#define BINANG_TO_DEG(binang) ((f32)(binang) * (180.0f / 0x8000))
#define SR_CE 0x00020000
#define SR_CH 0x00040000
#define gDPSetTextureConvert(pkt,type) gSPSetOtherMode(pkt, G_SETOTHERMODE_H, G_MDSFT_TEXTCONV, 3, type)
#define alSeqpGetChannelPriority alSeqpGetChlPriority
#define PI_DMA_BUFFER_SIZE 128
#define MI_INTR_MASK_CLR_SI (1 << 2)
#define gDPLoadMultiBlock_4bS(pkt,timg,tmem,rtile,fmt,width,height,pal,cms,cmt,masks,maskt,shifts,shiftt) { gDPSetTextureImage(pkt, fmt, G_IM_SIZ_16b, 1, timg); gDPSetTile(pkt, fmt, G_IM_SIZ_16b, 0, tmem, G_TX_LOADTILE, 0, cmt, maskt, shiftt, cms, masks, shifts); gDPLoadSync(pkt); gDPLoadBlock(pkt, G_TX_LOADTILE, 0, 0, (((width)*(height)+3)>>2)-1, 0 ); gDPPipeSync(pkt); gDPSetTile(pkt, fmt, G_IM_SIZ_4b, ((((width)>>1)+7)>>3), tmem, rtile, pal, cmt, maskt, shiftt, cms, masks, shifts); gDPSetTileSize(pkt, rtile, 0, 0, ((width)-1) << G_TEXTURE_IMAGE_FRAC, ((height)-1) << G_TEXTURE_IMAGE_FRAC); }
#define PFS_ERR_INCONSISTENT 3
#define gsSPSetGeometryMode(word) gsSPGeometryMode(0,(word))
#define SR_DE 0x00010000
#define G_RM_AA_ZB_OPA_DECAL RM_AA_ZB_OPA_DECAL(1)
#define gsSPTextureRectangle(xl,yl,xh,yh,tile,s,t,dsdx,dtdy) {{(_SHIFTL(G_TEXRECT, 24, 8) | _SHIFTL(xh, 12, 12) | _SHIFTL(yh, 0, 12)), (_SHIFTL(tile, 24, 3) | _SHIFTL(xl, 12, 12) | _SHIFTL(yl, 0, 12))}}, gsImmp1(G_RDPHALF_1, (_SHIFTL(s, 16, 16) | _SHIFTL(t, 0, 16))), gsImmp1(G_RDPHALF_2, (_SHIFTL(dsdx, 16, 16) | _SHIFTL(dtdy, 0, 16)))
#define AL_PHASE_DECAY 1
#define G_FOG 0x00010000

#define RM_AA_ZB_XLU_INTER(clk) AA_EN | Z_CMP | IM_RD | CVG_DST_WRAP | CLR_ON_CVG | FORCE_BL | ZMODE_INTER | GBL_c ##clk(G_BL_CLR_IN, G_BL_A_IN, G_BL_CLR_MEM, G_BL_1MA)
#define _OS_REG_H_ 
#define OS_VI_MPAL_HPF2 41
#define spSetZ spX2SetZ
#define AL_FX_SMALLROOM 1
#define OS_DCACHE_ROUNDUP_ADDR(x) (void *)(((((u32)(x)+0xf)/0x10)*0x10))
#define aClearBuffer(pkt,d,c) { Acmd *_a = (Acmd *)pkt; _a->words.w0 = _SHIFTL(A_CLEARBUFF, 24, 8) | _SHIFTL(d, 0, 24); _a->words.w1 = (unsigned int)(c); }
#define G_CC_MODULATEIDECALA TEXEL0, 0, SHADE, 0, 0, 0, 0, TEXEL0
#define SCREEN_WIDTH 320
#define G_SHADING_SMOOTH 0x00200000
#define G_RM_AA_XLU_SURF2 RM_AA_XLU_SURF(2)
#define OS_IM_SW2 0x00000601
#define THPROF_STACKSIZE 256
#define DPS_BUFTEST_ADDR_REG (DPS_BASE_REG + 0x08)
#define DPC_SET_XBUS_DMEM_DMA (1 << 1)
#define AI_MAX_DAC_RATE 16384
#define G_MWO_MATRIX_ZZ_ZW_F 0x34
#define G_ACMUX_SHADE 4
#define G_MWO_MATRIX_ZZ_ZW_I 0x14
#define G_SCALE_FRAC 8
#define RAMROM_FONTDATA_OFFSET 0xb70
#define aPoleFilter(pkt,f,g,s) { Acmd *_a = (Acmd *)pkt; _a->words.w0 = (_SHIFTL(A_POLEF, 24, 8) | _SHIFTL(f, 16, 8) | _SHIFTL(g, 0, 16)); _a->words.w1 = (unsigned int)(s); }
#define ALIGN32(val) (((val) + 0x1F) & ~0x1F)
#define SP_SET_INTR (1 << 4)
#define G_CC_MODULATEIA TEXEL0, 0, SHADE, 0, TEXEL0, 0, SHADE, 0
#define VI_H_SYNC_REG (VI_BASE_REG + 0x1C)
#define OS_VI_NTSC_HPN1 8
#define OS_VI_NTSC_HPN2 12
#define PFS_ERR_NEW_GBCART 13
#define SR_CUMASK 0xf0000000
#define SR_KSU_MASK 0x00000018
#define G_IM_SIZ_32b_SHIFT 0
#define G_SETCIMG 0xff
#define G_TX_MIRROR 0x1
#define ACTOR_FLAG_4000 (1 << 14)
#define OS_GBPAK_POWER_ON 0x01
#define G_CC_TRILERP TEXEL1, TEXEL0, LOD_FRACTION, TEXEL0, TEXEL1, TEXEL0, LOD_FRACTION, TEXEL0
#define OS_VI_BIT_INTERLACE 0x0002
#define G_TP_NONE (0 << G_MDSFT_TEXTPERSP)
#define FLASH_LATENCY 0x5
#define __log__ 
#define DPC_CLR_CLOCK_CTR (1 << 9)
#define C0_IMPSHIFT 8
#define G_RM_AA_ZB_TEX_EDGE RM_AA_ZB_TEX_EDGE(1)
#define ACTOR_FLAG_2000 (1 << 13)
#define gSPBranchLessZrg(pkt,dl,vtx,zval,near,far,flag,zmin,zmax) { Gfx *_g = (Gfx *)(pkt); _g->words.w0 = _SHIFTL(G_RDPHALF_1,24,8); _g->words.w1 = (unsigned int)(dl); _g = (Gfx *)(pkt); _g->words.w0 = (_SHIFTL(G_BRANCH_Z,24,8)| _SHIFTL((vtx)*5,12,12)|_SHIFTL((vtx)*2,0,12)); _g->words.w1 = G_DEPTOZSrg(zval, near, far, flag, zmin, zmax); }
#define _OS_PFS_H_ 
#define OS_VI_PAL_LPN1 14
#define OS_VI_PAL_LPN2 18
#define A_LOOP 0x02
#define OS_VI_MPAL_HPF1 37
#define FLASH_STATUS_ERASE_ERROR -1
typedef unsigned char u8;
typedef unsigned short u16;
typedef unsigned long u32;
typedef unsigned long long u64;
typedef signed char s8;
typedef short s16;
typedef long s32;
typedef long long s64;
typedef volatile unsigned char vu8;
typedef volatile unsigned short vu16;
typedef volatile unsigned long vu32;
typedef volatile unsigned long long vu64;
typedef volatile signed char vs8;
typedef volatile short vs16;
typedef volatile long vs32;
typedef volatile long long vs64;
typedef float f32;
typedef double f64;
typedef unsigned int size_t;
typedef s32 OSPri;
typedef s32 OSId;
typedef union {
    struct {
        f32 f_odd;
        f32 f_even;
    } f;
    f64 d;
} __OSfp;
typedef struct {
    u64 at, v0, v1, a0, a1, a2, a3;
    u64 t0, t1, t2, t3, t4, t5, t6, t7;
    u64 s0, s1, s2, s3, s4, s5, s6, s7;
    u64 t8, t9;
    u64 gp, sp, s8, ra;
    u64 lo, hi;
    u32 sr, pc, cause, badvaddr, rcp;
    u32 fpcsr;
    __OSfp fp0, fp2, fp4, fp6, fp8, fp10, fp12, fp14;
    __OSfp fp16, fp18, fp20, fp22, fp24, fp26, fp28, fp30;
} __OSThreadContext;
typedef struct {
    u32 flag;
    u32 count;
    u64 time;
} __OSThreadprofile_s;
typedef struct OSThread_s {
    struct OSThread_s *next;
    OSPri priority;
    struct OSThread_s **queue;
    struct OSThread_s *tlnext;
    u16 state;
    u16 flags;
    OSId id;
    int fp;
    __OSThreadprofile_s *thprof;
    __OSThreadContext context;
} OSThread;
extern void osCreateThread(OSThread *, OSId, void (*)(void *), void *, void *, OSPri);
extern void osDestroyThread(OSThread *);
extern void osYieldThread(void);
extern void osStartThread(OSThread *);
extern void osStopThread(OSThread *);
extern OSId osGetThreadId(OSThread *);
extern void osSetThreadPri(OSThread *, OSPri);
extern OSPri osGetThreadPri(OSThread *);
typedef u32 OSEvent;
typedef void *OSMesg;
typedef struct OSMesgQueue_s {
    OSThread *mtqueue;
    OSThread *fullqueue;
    s32 validCount;
    s32 first;
    s32 msgCount;
    OSMesg *msg;
} OSMesgQueue;
extern void osCreateMesgQueue(OSMesgQueue *, OSMesg *, s32);
extern s32 osSendMesg(OSMesgQueue *, OSMesg, s32);
extern s32 osJamMesg(OSMesgQueue *, OSMesg, s32);
extern s32 osRecvMesg(OSMesgQueue *, OSMesg *, s32);
extern void osSetEventMesg(OSEvent, OSMesgQueue *, OSMesg);
typedef u32 OSIntMask;
typedef u32 OSHWIntr;
extern OSIntMask osGetIntMask(void);
extern OSIntMask osSetIntMask(OSIntMask);
typedef u32 OSPageMask;
extern void osMapTLB(s32, OSPageMask, void *, u32, u32, s32);
extern void osMapTLBRdb(void);
extern void osUnmapTLB(s32);
extern void osUnmapTLBAll(void);
extern void osSetTLBASID(s32);
typedef struct {
    u32 errStatus;
    void *dramAddr;
    void *C2Addr;
    u32 sectorSize;
    u32 C1ErrNum;
    u32 C1ErrSector[4];
} __OSBlockInfo;
typedef struct {
    u32 cmdType;
    u16 transferMode;
    u16 blockNum;
    s32 sectorNum;
    u32 devAddr;
    u32 bmCtlShadow;
    u32 seqCtlShadow;
    __OSBlockInfo block[2];
} __OSTranxInfo;
typedef struct OSPiHandle_s {
    struct OSPiHandle_s *next;
    u8 type;
    u8 latency;
    u8 pageSize;
    u8 relDuration;
    u8 pulse;
    u8 domain;
    u32 baseAddress;
    u32 speed;
    __OSTranxInfo transferInfo;
} OSPiHandle;
typedef struct {
    u8 type;
    u32 address;
} OSPiInfo;
typedef struct {
    u16 type;
    u8 pri;
    u8 status;
    OSMesgQueue *retQueue;
} OSIoMesgHdr;
typedef struct {
    OSIoMesgHdr hdr;
    void *dramAddr;
    u32 devAddr;
    u32 size;
    OSPiHandle *piHandle;
} OSIoMesg;
typedef struct {
    s32 active;
    OSThread *thread;
    OSMesgQueue *cmdQueue;
    OSMesgQueue *evtQueue;
    OSMesgQueue *acsQueue;
    s32 (*dma)(s32, u32, void *, u32);
    s32 (*edma)(OSPiHandle *, s32, u32, void *, u32);
} OSDevMgr;
extern OSPiHandle *__osPiTable;
extern u32 osPiGetStatus(void);
extern s32 osPiGetDeviceType(void);
extern s32 osPiWriteIo(u32, u32);
extern s32 osPiReadIo(u32, u32 *);
extern s32 osPiStartDma(OSIoMesg *, s32, s32, u32, void *, u32, OSMesgQueue *);
extern void osCreatePiManager(OSPri, OSMesgQueue *, OSMesg *, s32);
extern OSPiHandle *osCartRomInit(void);
extern OSPiHandle *osLeoDiskInit(void);
extern OSPiHandle *osDriveRomInit(void);
extern s32 osEPiDeviceType(OSPiHandle *, OSPiInfo *);
extern s32 osEPiWriteIo(OSPiHandle *, u32 , u32 );
extern s32 osEPiReadIo(OSPiHandle *, u32 , u32 *);
extern s32 osEPiStartDma(OSPiHandle *, OSIoMesg *, s32);
extern s32 osEPiLinkHandle(OSPiHandle *);
typedef struct {
    u32 ctrl;
    u32 width;
    u32 burst;
    u32 vSync;
    u32 hSync;
    u32 leap;
    u32 hStart;
    u32 xScale;
    u32 vCurrent;
} OSViCommonRegs;
typedef struct {
    u32 origin;
    u32 yScale;
    u32 vStart;
    u32 vBurst;
    u32 vIntr;
} OSViFieldRegs;
typedef struct {
    u8 type;
    OSViCommonRegs comRegs;
    OSViFieldRegs fldRegs[2];
} OSViMode;
extern OSViMode osViModeTable[];
extern OSViMode osViModeNtscLpn1;
extern OSViMode osViModeNtscLpf1;
extern OSViMode osViModeNtscLan1;
extern OSViMode osViModeNtscLaf1;
extern OSViMode osViModeNtscLpn2;
extern OSViMode osViModeNtscLpf2;
extern OSViMode osViModeNtscLan2;
extern OSViMode osViModeNtscLaf2;
extern OSViMode osViModeNtscHpn1;
extern OSViMode osViModeNtscHpf1;
extern OSViMode osViModeNtscHan1;
extern OSViMode osViModeNtscHaf1;
extern OSViMode osViModeNtscHpn2;
extern OSViMode osViModeNtscHpf2;
extern OSViMode osViModePalLpn1;
extern OSViMode osViModePalLpf1;
extern OSViMode osViModePalLan1;
extern OSViMode osViModePalLaf1;
extern OSViMode osViModePalLpn2;
extern OSViMode osViModePalLpf2;
extern OSViMode osViModePalLan2;
extern OSViMode osViModePalLaf2;
extern OSViMode osViModePalHpn1;
extern OSViMode osViModePalHpf1;
extern OSViMode osViModePalHan1;
extern OSViMode osViModePalHaf1;
extern OSViMode osViModePalHpn2;
extern OSViMode osViModePalHpf2;
extern OSViMode osViModeMpalLpn1;
extern OSViMode osViModeMpalLpf1;
extern OSViMode osViModeMpalLan1;
extern OSViMode osViModeMpalLaf1;
extern OSViMode osViModeMpalLpn2;
extern OSViMode osViModeMpalLpf2;
extern OSViMode osViModeMpalLan2;
extern OSViMode osViModeMpalLaf2;
extern OSViMode osViModeMpalHpn1;
extern OSViMode osViModeMpalHpf1;
extern OSViMode osViModeMpalHan1;
extern OSViMode osViModeMpalHaf1;
extern OSViMode osViModeMpalHpn2;
extern OSViMode osViModeMpalHpf2;
extern OSViMode osViModeFpalLpn1;
extern OSViMode osViModeFpalLpf1;
extern OSViMode osViModeFpalLan1;
extern OSViMode osViModeFpalLaf1;
extern OSViMode osViModeFpalLpn2;
extern OSViMode osViModeFpalLpf2;
extern OSViMode osViModeFpalLan2;
extern OSViMode osViModeFpalLaf2;
extern OSViMode osViModeFpalHpn1;
extern OSViMode osViModeFpalHpf1;
extern OSViMode osViModeFpalHan1;
extern OSViMode osViModeFpalHaf1;
extern OSViMode osViModeFpalHpn2;
extern OSViMode osViModeFpalHpf2;
extern u32 osViGetStatus(void);
extern u32 osViGetCurrentMode(void);
extern u32 osViGetCurrentLine(void);
extern u32 osViGetCurrentField(void);
extern void *osViGetCurrentFramebuffer(void);
extern void *osViGetNextFramebuffer(void);
extern void osViSetXScale(f32);
extern void osViSetYScale(f32);
extern void osViExtendVStart(u32);
extern void osViSetSpecialFeatures(u32);
extern void osViSetMode(OSViMode *);
extern void osViSetEvent(OSMesgQueue *, OSMesg, u32);
extern void osViSwapBuffer(void *);
extern void osViBlack(u8);
extern void osViFade(u8, u16);
extern void osViRepeatLine(u8);
extern void osCreateViManager(OSPri);
extern u32 osAiGetStatus(void);
extern u32 osAiGetLength(void);
extern s32 osAiSetFrequency(u32);
extern s32 osAiSetNextBuffer(void *, u32);
typedef u64 OSTime;
typedef struct OSTimer_s {
 struct OSTimer_s *next;
 struct OSTimer_s *prev;
 OSTime interval;
 OSTime value;
 OSMesgQueue *mq;
 OSMesg msg;
} OSTimer;
extern OSTime osGetTime(void);
extern void osSetTime(OSTime);
extern int osSetTimer(OSTimer *, OSTime, OSTime,
       OSMesgQueue *, OSMesg);
extern int osStopTimer(OSTimer *);
typedef struct {
 u16 type;
 u8 status;
 u8 errno;
}OSContStatus;
typedef struct {
 u16 button;
 s8 stick_x;
 s8 stick_y;
 u8 errno;
} OSContPad;
typedef struct {
 void *address;
 u8 databuffer[32];
        u8 addressCrc;
 u8 dataCrc;
 u8 errno;
} OSContRamIo;
extern s32 osContInit(OSMesgQueue *, u8 *, OSContStatus *);
extern s32 osContReset(OSMesgQueue *, OSContStatus *);
extern s32 osContStartQuery(OSMesgQueue *);
extern s32 osContStartReadData(OSMesgQueue *);
extern s32 osContSetCh(u8);
extern void osContGetQuery(OSContStatus *);
extern void osContGetReadData(OSContPad *);
typedef struct {
 int status;
 OSMesgQueue *queue;
 int channel;
 u8 id[32];
 u8 label[32];
 int version;
 int dir_size;
 int inode_table;
 int minode_table;
 int dir_table;
 int inode_start_page;
 u8 banks;
 u8 activebank;
} OSPfs;
typedef struct {
 u32 file_size;
   u32 game_code;
   u16 company_code;
   char ext_name[4];
   char game_name[16];
} OSPfsState;
extern s32 osPfsInitPak(OSMesgQueue *, OSPfs *, int);
extern s32 osPfsRepairId(OSPfs *);
extern s32 osPfsInit(OSMesgQueue *, OSPfs *, int);
extern s32 osPfsReFormat(OSPfs *, OSMesgQueue *, int);
extern s32 osPfsChecker(OSPfs *);
extern s32 osPfsAllocateFile(OSPfs *, u16, u32, u8 *, u8 *, int, s32 *);
extern s32 osPfsFindFile(OSPfs *, u16, u32, u8 *, u8 *, s32 *);
extern s32 osPfsDeleteFile(OSPfs *, u16, u32, u8 *, u8 *);
extern s32 osPfsReadWriteFile(OSPfs *, s32, u8, int, int, u8 *);
extern s32 osPfsFileState(OSPfs *, s32, OSPfsState *);
extern s32 osPfsGetLabel(OSPfs *, u8 *, int *);
extern s32 osPfsSetLabel(OSPfs *, u8 *);
extern s32 osPfsIsPlug(OSMesgQueue *, u8 *);
extern s32 osPfsFreeBlocks(OSPfs *, s32 *);
extern s32 osPfsNumFiles(OSPfs *, s32 *, s32 *);
typedef struct {
  u16 fixed1;
  u16 start_address;
  u8 nintendo_chr[0x30];
  u8 game_title[16];
  u16 company_code;
  u8 body_code;
  u8 cart_type;
  u8 rom_size;
  u8 ram_size;
  u8 country_code;
  u8 fixed2;
  u8 version;
  u8 isum;
  u16 sum;
} OSGbpakId;
extern s32 osGbpakInit(OSMesgQueue *, OSPfs *, int);
extern s32 osGbpakPower(OSPfs *, s32);
extern s32 osGbpakGetStatus(OSPfs *, u8 *);
extern s32 osGbpakReadWrite(OSPfs *, u16, u16, u8 *, u16);
extern s32 osGbpakReadId(OSPfs *, OSGbpakId *, u8 *);
extern s32 osGbpakCheckConnector(OSPfs *, u8 *);
typedef struct {
  OSMesgQueue *__mq;
  int __channel;
  s32 __mode;
  u8 cmd_status;
} OSVoiceHandle;
typedef struct {
  u16 warning;
  u16 answer_num;
  u16 voice_level;
  u16 voice_sn;
  u16 voice_time;
  u16 answer[5];
  u16 distance[5];
} OSVoiceData;
extern s32 osVoiceInit(OSMesgQueue *, OSVoiceHandle *, int);
extern s32 osVoiceCheckWord(u8 *data);
extern s32 osVoiceClearDictionary(OSVoiceHandle *, u8);
extern s32 osVoiceControlGain(OSVoiceHandle *, s32, s32);
extern s32 osVoiceSetWord(OSVoiceHandle *, u8 *);
extern s32 osVoiceStartReadData(OSVoiceHandle *);
extern s32 osVoiceStopReadData(OSVoiceHandle *);
extern s32 osVoiceGetReadData(OSVoiceHandle *, OSVoiceData *);
extern s32 osVoiceMaskDictionary(OSVoiceHandle *, u8 *, int);
extern void osVoiceCountSyllables(u8 *, u32 *);
extern void osInvalDCache(void *, s32);
extern void osInvalICache(void *, s32);
extern void osWritebackDCache(void *, s32);
extern void osWritebackDCacheAll(void);
typedef struct {
 u16 *histo_base;
 u32 histo_size;
 u32 *text_start;
 u32 *text_end;
} OSProf;
extern void osProfileInit(OSProf *, u32 profcnt);
extern void osProfileStart(u32);
extern void osProfileFlush(void);
extern void osProfileStop(void);
extern void osThreadProfileClear(OSId);
extern void osThreadProfileInit(void);
extern void osThreadProfileStart(void);
extern void osThreadProfileStop(void);
extern u32 osThreadProfileReadCount(OSId);
extern u32 osThreadProfileReadCountTh(OSThread*);
extern OSTime osThreadProfileReadTime(OSId);
extern OSTime osThreadProfileReadTimeTh(OSThread*);
extern u32 osGetCount(void);
extern s32 osRomType;
extern void *osRomBase;
extern s32 osTvType;
extern s32 osResetType;
extern s32 osCicId;
extern s32 osVersion;
extern u32 osMemSize;
extern s32 osAppNMIBuffer[];
extern u64 osClockRate;
extern OSIntMask __OSGlobalIntMask;
extern void osInitialize(void);
extern void osExit(void);
extern u32 osGetMemSize(void);
extern s32 osAfterPreNMI(void);
extern s32 osEepromProbe(OSMesgQueue *);
extern s32 osEepromRead(OSMesgQueue *, u8, u8 *);
extern s32 osEepromWrite(OSMesgQueue *, u8, u8 *);
extern s32 osEepromLongRead(OSMesgQueue *, u8, u8 *, int);
extern s32 osEepromLongWrite(OSMesgQueue *, u8, u8 *, int);
extern OSPiHandle *osFlashReInit(u8 latency, u8 pulse,
                 u8 page_size, u8 rel_duration, u32 start);
extern OSPiHandle *osFlashInit(void);
extern void osFlashReadStatus(u8 *flash_status);
extern void osFlashReadId(u32 *flash_type, u32 *flash_maker);
extern void osFlashClearStatus(void);
extern s32 osFlashAllErase(void);
extern s32 osFlashSectorErase(u32 page_num);
extern s32 osFlashWriteBuffer(OSIoMesg *mb, s32 priority,
                void *dramAddr, OSMesgQueue *mq);
extern s32 osFlashWriteArray(u32 page_num);
extern s32 osFlashReadArray(OSIoMesg *mb, s32 priority, u32 page_num,
                void *dramAddr, u32 n_pages, OSMesgQueue *mq);
extern void osFlashChange(u32 flash_num);
extern void osFlashAllEraseThrough(void);
extern void osFlashSectorEraseThrough(u32 page_num);
extern s32 osFlashCheckEraseEnd(void);
extern void __osInitialize_common(void);
extern s32 osTestHost(void);
extern void osReadHost(void *, u32);
extern void osWriteHost(void *, u32);
extern void osAckRamromRead(void);
extern void osAckRamromWrite(void);
extern void osInitRdb(u8 *sendBuf, u32 sendSize);
extern u32 osVirtualToPhysical(void *);
extern void * osPhysicalToVirtual(u32);
extern u32 osDpGetStatus(void);
extern void osDpSetStatus(u32);
extern void osDpGetCounters(u32 *);
extern s32 osDpSetNextBuffer(void *, u64);
extern s32 osMotorInit(OSMesgQueue *, OSPfs *, int);
extern s32 __osMotorAccess(OSPfs *, s32);
extern void bcopy(const void *, void *, int);
extern int bcmp(const void *, const void *, int);
extern void bzero(void *, int);
extern int sprintf(char *s, const char *fmt, ...);
extern void osSyncPrintf(const char *fmt, ...);
typedef struct _Region_s {
 u8 *r_startBufferAddress;
 u8 *r_endAddress;
 s32 r_bufferSize;
 s32 r_bufferCount;
 u16 r_freeList;
 u16 r_alignSize;
} OSRegion;
extern void *osCreateRegion(void *, u32, u32, u32);
extern void *osMalloc(void *);
extern void osFree(void *, void *);
extern s32 osGetRegionBufCount(void *);
extern s32 osGetRegionBufSize(void *);
extern void rmonMain( void * );
extern void rmonPrintf( const char *, ... );
typedef struct {
 u32 type;
 u32 flags;
 u64 *ucode_boot;
 u32 ucode_boot_size;
 u64 *ucode;
 u32 ucode_size;
 u64 *ucode_data;
 u32 ucode_data_size;
 u64 *dram_stack;
 u32 dram_stack_size;
 u64 *output_buff;
 u64 *output_buff_size;
 u64 *data_ptr;
 u32 data_size;
 u64 *yield_data_ptr;
 u32 yield_data_size;
} OSTask_t;
typedef union {
    OSTask_t t;
    long long int force_structure_alignment;
} OSTask;
typedef u32 OSYieldResult;
extern void osSpTaskLoad(OSTask *tp);
extern void osSpTaskStartGo(OSTask *tp);
extern void osSpTaskYield(void);
extern OSYieldResult osSpTaskYielded(OSTask *tp);
typedef struct {
 short ob[3];
 unsigned short flag;
 short tc[2];
 unsigned char cn[4];
} Vtx_t;
typedef struct {
 short ob[3];
 unsigned short flag;
 short tc[2];
 signed char n[3];
 unsigned char a;
} Vtx_tn;
typedef union {
    Vtx_t v;
    Vtx_tn n;
    long long int force_structure_alignment;
} Vtx;
typedef struct {
  void *SourceImagePointer;
  void *TlutPointer;
  short Stride;
  short SubImageWidth;
  short SubImageHeight;
  char SourceImageType;
  char SourceImageBitSize;
  short SourceImageOffsetS;
  short SourceImageOffsetT;
  char dummy[4];
} uSprite_t;
typedef union {
  uSprite_t s;
  long long int force_structure_allignment[3];
} uSprite;
typedef struct {
 unsigned char flag;
 unsigned char v[3];
} Tri;
typedef long Mtx_t[4][4];
typedef union {
    Mtx_t m;
    long long int force_structure_alignment;
} Mtx;
typedef struct {
 short vscale[4];
 short vtrans[4];
} Vp_t;
typedef union {
    Vp_t vp;
    long long int force_structure_alignment;
} Vp;
typedef struct {
  unsigned char col[3];
  char pad1;
  unsigned char colc[3];
  char pad2;
  signed char dir[3];
  char pad3;
} Light_t;
typedef struct {
    unsigned char col[3];
    unsigned char kc;
    unsigned char colc[3];
    unsigned char kl;
    short pos[3];
    unsigned char kq;
} PointLight_t;
typedef struct {
  unsigned char col[3];
  char pad1;
  unsigned char colc[3];
  char pad2;
} Ambient_t;
typedef struct {
  int x1,y1,x2,y2;
} Hilite_t;
typedef union {
    Light_t l;
    PointLight_t p;
    long long int force_structure_alignment[2];
} Light;
typedef union {
    Ambient_t l;
    long long int force_structure_alignment[1];
} Ambient;
typedef struct {
    Ambient a;
    Light l[7];
} Lightsn;
typedef struct {
    Ambient a;
    Light l[1];
} Lights0;
typedef struct {
    Ambient a;
    Light l[1];
} Lights1;
typedef struct {
    Ambient a;
    Light l[2];
} Lights2;
typedef struct {
    Ambient a;
    Light l[3];
} Lights3;
typedef struct {
    Ambient a;
    Light l[4];
} Lights4;
typedef struct {
    Ambient a;
    Light l[5];
} Lights5;
typedef struct {
    Ambient a;
    Light l[6];
} Lights6;
typedef struct {
    Ambient a;
    Light l[7];
} Lights7;
typedef struct {
    Light l[2];
} LookAt;
typedef union {
    Hilite_t h;
    long int force_structure_alignment[4];
} Hilite;
typedef struct {
 int cmd:8;
 unsigned int par:8;
 unsigned int len:16;
 unsigned int addr;
} Gdma;
typedef struct {
  int cmd:8;
  int pad:24;
  Tri tri;
} Gtri;
typedef struct {
  int cmd:8;
  int pad1:24;
  int pad2:24;
  unsigned char param:8;
} Gpopmtx;
typedef struct {
  int cmd:8;
  int pad0:8;
  int mw_index:8;
  int number:8;
  int pad1:8;
  int base:24;
} Gsegment;
typedef struct {
  int cmd:8;
  int pad0:8;
  int sft:8;
  int len:8;
  unsigned int data:32;
} GsetothermodeL;
typedef struct {
  int cmd:8;
  int pad0:8;
  int sft:8;
  int len:8;
  unsigned int data:32;
} GsetothermodeH;
typedef struct {
  unsigned char cmd;
  unsigned char lodscale;
  unsigned char tile;
  unsigned char on;
  unsigned short s;
  unsigned short t;
} Gtexture;
typedef struct {
  int cmd:8;
  int pad:24;
  Tri line;
} Gline3D;
typedef struct {
  int cmd:8;
  int pad1:24;
  short int pad2;
  short int scale;
} Gperspnorm;
typedef struct {
                int cmd:8;
                unsigned int fmt:3;
                unsigned int siz:2;
                unsigned int pad:7;
                unsigned int wd:12;
                unsigned int dram;
} Gsetimg;
typedef struct {
  int cmd:8;
  unsigned int muxs0:24;
  unsigned int muxs1:32;
} Gsetcombine;
typedef struct {
  int cmd:8;
  unsigned char pad;
  unsigned char prim_min_level;
  unsigned char prim_level;
  unsigned long color;
} Gsetcolor;
typedef struct {
  int cmd:8;
  int x0:10;
  int x0frac:2;
  int y0:10;
  int y0frac:2;
  unsigned int pad:8;
  int x1:10;
  int x1frac:2;
  int y1:10;
  int y1frac:2;
} Gfillrect;
typedef struct {
  int cmd:8;
  unsigned int fmt:3;
  unsigned int siz:2;
  unsigned int pad0:1;
  unsigned int line:9;
  unsigned int tmem:9;
  unsigned int pad1:5;
  unsigned int tile:3;
  unsigned int palette:4;
  unsigned int ct:1;
  unsigned int mt:1;
  unsigned int maskt:4;
  unsigned int shiftt:4;
  unsigned int cs:1;
  unsigned int ms:1;
  unsigned int masks:4;
  unsigned int shifts:4;
} Gsettile;
typedef struct {
  int cmd:8;
  unsigned int sl:12;
  unsigned int tl:12;
  int pad:5;
  unsigned int tile:3;
  unsigned int sh:12;
  unsigned int th:12;
} Gloadtile;
typedef Gloadtile Gloadblock;
typedef Gloadtile Gsettilesize;
typedef Gloadtile Gloadtlut;
typedef struct {
  unsigned int cmd:8;
  unsigned int xl:12;
  unsigned int yl:12;
  unsigned int pad1:5;
  unsigned int tile:3;
  unsigned int xh:12;
  unsigned int yh:12;
  unsigned int s:16;
  unsigned int t:16;
  unsigned int dsdx:16;
  unsigned int dtdy:16;
} Gtexrect;
typedef struct {
    unsigned long w0;
    unsigned long w1;
    unsigned long w2;
    unsigned long w3;
} TexRect;
typedef struct {
 unsigned int w0;
 unsigned int w1;
} Gwords;
typedef union {
 Gwords words;
 Gdma dma;
 Gtri tri;
 Gline3D line;
 Gpopmtx popmtx;
 Gsegment segment;
 GsetothermodeH setothermodeH;
 GsetothermodeL setothermodeL;
 Gtexture texture;
 Gperspnorm perspnorm;
 Gsetimg setimg;
 Gsetcombine setcombine;
 Gsetcolor setcolor;
 Gfillrect fillrect;
 Gsettile settile;
 Gloadtile loadtile;
 Gsettilesize settilesize;
 Gloadtlut loadtlut;
        long long int force_structure_alignment;
} Gfx;
typedef struct {
   unsigned int cmd:8;
 unsigned int flags:8;
 unsigned int gain:16;
 unsigned int addr;
} Aadpcm;
typedef struct {
   unsigned int cmd:8;
 unsigned int flags:8;
 unsigned int gain:16;
 unsigned int addr;
} Apolef;
typedef struct {
   unsigned int cmd:8;
 unsigned int flags:8;
 unsigned int pad1:16;
 unsigned int addr;
} Aenvelope;
typedef struct {
   unsigned int cmd:8;
 unsigned int pad1:8;
 unsigned int dmem:16;
 unsigned int pad2:16;
 unsigned int count:16;
} Aclearbuff;
typedef struct {
   unsigned int cmd:8;
 unsigned int pad1:8;
 unsigned int pad2:16;
 unsigned int inL:16;
        unsigned int inR:16;
} Ainterleave;
typedef struct {
   unsigned int cmd:8;
 unsigned int pad1:24;
 unsigned int addr;
} Aloadbuff;
typedef struct {
   unsigned int cmd:8;
 unsigned int flags:8;
 unsigned int pad1:16;
 unsigned int addr;
} Aenvmixer;
typedef struct {
   unsigned int cmd:8;
 unsigned int flags:8;
 unsigned int gain:16;
 unsigned int dmemi:16;
 unsigned int dmemo:16;
} Amixer;
typedef struct {
   unsigned int cmd:8;
 unsigned int flags:8;
 unsigned int dmem2:16;
 unsigned int addr;
} Apan;
typedef struct {
   unsigned int cmd:8;
 unsigned int flags:8;
 unsigned int pitch:16;
 unsigned int addr;
} Aresample;
typedef struct {
   unsigned int cmd:8;
 unsigned int flags:8;
 unsigned int pad1:16;
 unsigned int addr;
} Areverb;
typedef struct {
   unsigned int cmd:8;
 unsigned int pad1:24;
 unsigned int addr;
} Asavebuff;
typedef struct {
   unsigned int cmd:8;
 unsigned int pad1:24;
 unsigned int pad2:2;
 unsigned int number:4;
 unsigned int base:24;
} Asegment;
typedef struct {
   unsigned int cmd:8;
 unsigned int flags:8;
 unsigned int dmemin:16;
 unsigned int dmemout:16;
 unsigned int count:16;
} Asetbuff;
typedef struct {
   unsigned int cmd:8;
 unsigned int flags:8;
 unsigned int vol:16;
 unsigned int voltgt:16;
 unsigned int volrate:16;
} Asetvol;
typedef struct {
    unsigned int cmd:8;
    unsigned int pad1:8;
    unsigned int dmemin:16;
    unsigned int dmemout:16;
    unsigned int count:16;
} Admemmove;
typedef struct {
    unsigned int cmd:8;
    unsigned int pad1:8;
    unsigned int count:16;
    unsigned int addr;
} Aloadadpcm;
typedef struct {
    unsigned int cmd:8;
    unsigned int pad1:8;
    unsigned int pad2:16;
    unsigned int addr;
} Asetloop;
typedef struct {
 unsigned int w0;
 unsigned int w1;
} Awords;
typedef union {
 Awords words;
 Aadpcm adpcm;
        Apolef polef;
 Aclearbuff clearbuff;
 Aenvelope envelope;
        Ainterleave interleave;
 Aloadbuff loadbuff;
        Aenvmixer envmixer;
 Aresample resample;
 Areverb reverb;
 Asavebuff savebuff;
 Asegment segment;
 Asetbuff setbuff;
 Asetvol setvol;
        Admemmove dmemmove;
        Aloadadpcm loadadpcm;
        Amixer mixer;
        Asetloop setloop;
        long long int force_union_align;
} Acmd;
typedef short ADPCM_STATE[16];
typedef short POLEF_STATE[4];
typedef short RESAMPLE_STATE[16];
typedef short ENVMIX_STATE[40];
typedef s32 ALMicroTime;
typedef u8 ALPan;
typedef struct ALLink_s {
    struct ALLink_s *next;
    struct ALLink_s *prev;
} ALLink;
void alUnlink(ALLink *element);
void alLink(ALLink *element, ALLink *after);
typedef s32 (*ALDMAproc)(s32 addr, s32 len, void *state);
typedef ALDMAproc (*ALDMANew)(void *state);
void alCopy(void *src, void *dest, s32 len);
typedef struct {
    u8 *base;
    u8 *cur;
    s32 len;
    s32 count;
} ALHeap;
void alHeapInit(ALHeap *hp, u8 *base, s32 len);
void *alHeapDBAlloc(u8 *file, s32 line, ALHeap *hp, s32 num, s32 size);
s32 alHeapCheck(ALHeap *hp);
typedef u8 ALFxId;
typedef void *ALFxRef;
enum {AL_ADPCM_WAVE = 0,
         AL_RAW16_WAVE};
typedef struct {
    s32 order;
    s32 npredictors;
    s16 book[1];
} ALADPCMBook;
typedef struct {
    u32 start;
    u32 end;
    u32 count;
    ADPCM_STATE state;
} ALADPCMloop;
typedef struct {
    u32 start;
    u32 end;
    u32 count;
} ALRawLoop;
typedef struct {
    ALMicroTime attackTime;
    ALMicroTime decayTime;
    ALMicroTime releaseTime;
    u8 attackVolume;
    u8 decayVolume;
} ALEnvelope;
typedef struct {
    u8 velocityMin;
    u8 velocityMax;
    u8 keyMin;
    u8 keyMax;
    u8 keyBase;
    s8 detune;
} ALKeyMap;
typedef struct {
    ALADPCMloop *loop;
    ALADPCMBook *book;
} ALADPCMWaveInfo;
typedef struct {
    ALRawLoop *loop;
} ALRAWWaveInfo;
typedef struct ALWaveTable_s {
    u8 *base;
    s32 len;
    u8 type;
    u8 flags;
    union {
        ALADPCMWaveInfo adpcmWave;
        ALRAWWaveInfo rawWave;
    } waveInfo;
} ALWaveTable;
typedef struct ALSound_s {
    ALEnvelope *envelope;
    ALKeyMap *keyMap;
    ALWaveTable *wavetable;
    ALPan samplePan;
    u8 sampleVolume;
    u8 flags;
} ALSound;
typedef struct {
    u8 volume;
    ALPan pan;
    u8 priority;
    u8 flags;
    u8 tremType;
    u8 tremRate;
    u8 tremDepth;
    u8 tremDelay;
    u8 vibType;
    u8 vibRate;
    u8 vibDepth;
    u8 vibDelay;
    s16 bendRange;
    s16 soundCount;
    ALSound *soundArray[1];
} ALInstrument;
typedef struct ALBank_s {
    s16 instCount;
    u8 flags;
    u8 pad;
    s32 sampleRate;
    ALInstrument *percussion;
    ALInstrument *instArray[1];
} ALBank;
typedef struct {
    s16 revision;
    s16 bankCount;
    ALBank *bankArray[1];
} ALBankFile;
void alBnkfNew(ALBankFile *f, u8 *table);
typedef struct {
    u8 *offset;
    s32 len;
} ALSeqData;
typedef struct {
    s16 revision;
    s16 seqCount;
    ALSeqData seqArray[1];
} ALSeqFile;
void alSeqFileNew(ALSeqFile *f, u8 *base);
typedef ALMicroTime (*ALVoiceHandler)(void *);
typedef struct {
    s32 maxVVoices;
    s32 maxPVoices;
    s32 maxUpdates;
    s32 maxFXbusses;
    void *dmaproc;
    ALHeap *heap;
    s32 outputRate;
    ALFxId fxType;
    s32 *params;
} ALSynConfig;
typedef struct ALPlayer_s {
    struct ALPlayer_s *next;
    void *clientData;
    ALVoiceHandler handler;
    ALMicroTime callTime;
    s32 samplesLeft;
} ALPlayer;
typedef struct ALVoice_s {
    ALLink node;
    struct PVoice_s *pvoice;
    ALWaveTable *table;
    void *clientPrivate;
    s16 state;
    s16 priority;
    s16 fxBus;
    s16 unityPitch;
} ALVoice;
typedef struct ALVoiceConfig_s {
    s16 priority;
    s16 fxBus;
    u8 unityPitch;
} ALVoiceConfig;
typedef struct {
    ALPlayer *head;
    ALLink pFreeList;
    ALLink pAllocList;
    ALLink pLameList;
    s32 paramSamples;
    s32 curSamples;
    ALDMANew dma;
    ALHeap *heap;
    struct ALParam_s *paramList;
    struct ALMainBus_s *mainBus;
    struct ALAuxBus_s *auxBus;
    struct ALFilter_s *outputFilter;
    s32 numPVoices;
    s32 maxAuxBusses;
    s32 outputRate;
    s32 maxOutSamples;
} ALSynth;
void alSynNew(ALSynth *s, ALSynConfig *config);
void alSynDelete(ALSynth *s);
void alSynAddPlayer(ALSynth *s, ALPlayer *client);
void alSynRemovePlayer(ALSynth *s, ALPlayer *client);
s32 alSynAllocVoice(ALSynth *s, ALVoice *v, ALVoiceConfig *vc);
void alSynFreeVoice(ALSynth *s, ALVoice *voice);
void alSynStartVoice(ALSynth *s, ALVoice *voice, ALWaveTable *w);
void alSynStartVoiceParams(ALSynth *s, ALVoice *voice, ALWaveTable *w,
                              f32 pitch, s16 vol, ALPan pan, u8 fxmix,
                              ALMicroTime t);
void alSynStopVoice(ALSynth *s, ALVoice *voice);
void alSynSetVol(ALSynth *s, ALVoice *v, s16 vol, ALMicroTime delta);
void alSynSetPitch(ALSynth *s, ALVoice *voice, f32 ratio);
void alSynSetPan(ALSynth *s, ALVoice *voice, ALPan pan);
void alSynSetFXMix(ALSynth *s, ALVoice *voice, u8 fxmix);
void alSynSetPriority(ALSynth *s, ALVoice *voice, s16 priority);
s16 alSynGetPriority(ALSynth *s, ALVoice *voice);
ALFxRef *alSynAllocFX(ALSynth *s, s16 bus, ALSynConfig *c, ALHeap *hp);
ALFxRef alSynGetFXRef(ALSynth *s, s16 bus, s16 index);
void alSynFreeFX(ALSynth *s, ALFxRef *fx);
void alSynSetFXParam(ALSynth *s, ALFxRef fx, s16 paramID, void *param);
typedef struct {
    ALSynth drvr;
} ALGlobals;
extern ALGlobals *alGlobals;
void alInit(ALGlobals *glob, ALSynConfig *c);
void alClose(ALGlobals *glob);
Acmd *alAudioFrame(Acmd *cmdList, s32 *cmdLen, s16 *outBuf, s32 outLen);
enum ALMsg {
    AL_SEQ_REF_EVT,
    AL_SEQ_MIDI_EVT,
    AL_SEQP_MIDI_EVT,
    AL_TEMPO_EVT,
    AL_SEQ_END_EVT,
    AL_NOTE_END_EVT,
    AL_SEQP_ENV_EVT,
    AL_SEQP_META_EVT,
    AL_SEQP_PROG_EVT,
    AL_SEQP_API_EVT,
    AL_SEQP_VOL_EVT,
    AL_SEQP_LOOP_EVT,
    AL_SEQP_PRIORITY_EVT,
    AL_SEQP_SEQ_EVT,
    AL_SEQP_BANK_EVT,
    AL_SEQP_PLAY_EVT,
    AL_SEQP_STOP_EVT,
    AL_SEQP_STOPPING_EVT,
    AL_TRACK_END,
    AL_CSP_LOOPSTART,
    AL_CSP_LOOPEND,
    AL_CSP_NOTEOFF_EVT,
    AL_TREM_OSC_EVT,
    AL_VIB_OSC_EVT
};
enum AL_MIDIstatus {
    AL_MIDI_ChannelMask = 0x0F,
    AL_MIDI_StatusMask = 0xF0,
    AL_MIDI_ChannelVoice = 0x80,
    AL_MIDI_NoteOff = 0x80,
    AL_MIDI_NoteOn = 0x90,
    AL_MIDI_PolyKeyPressure = 0xA0,
    AL_MIDI_ControlChange = 0xB0,
    AL_MIDI_ChannelModeSelect = 0xB0,
    AL_MIDI_ProgramChange = 0xC0,
    AL_MIDI_ChannelPressure = 0xD0,
    AL_MIDI_PitchBendChange = 0xE0,
    AL_MIDI_SysEx = 0xF0,
    AL_MIDI_SystemCommon = 0xF1,
    AL_MIDI_TimeCodeQuarterFrame = 0xF1,
    AL_MIDI_SongPositionPointer = 0xF2,
    AL_MIDI_SongSelect = 0xF3,
    AL_MIDI_Undefined1 = 0xF4,
    AL_MIDI_Undefined2 = 0xF5,
    AL_MIDI_TuneRequest = 0xF6,
    AL_MIDI_EOX = 0xF7,
    AL_MIDI_SystemRealTime = 0xF8,
    AL_MIDI_TimingClock = 0xF8,
    AL_MIDI_Undefined3 = 0xF9,
    AL_MIDI_Start = 0xFA,
    AL_MIDI_Continue = 0xFB,
    AL_MIDI_Stop = 0xFC,
    AL_MIDI_Undefined4 = 0xFD,
    AL_MIDI_ActiveSensing = 0xFE,
    AL_MIDI_SystemReset = 0xFF,
    AL_MIDI_Meta = 0xFF
};
enum AL_MIDIctrl {
    AL_MIDI_VOLUME_CTRL = 0x07,
    AL_MIDI_PAN_CTRL = 0x0A,
    AL_MIDI_PRIORITY_CTRL = 0x10,
    AL_MIDI_FX_CTRL_0 = 0x14,
    AL_MIDI_FX_CTRL_1 = 0x15,
    AL_MIDI_FX_CTRL_2 = 0x16,
    AL_MIDI_FX_CTRL_3 = 0x17,
    AL_MIDI_FX_CTRL_4 = 0x18,
    AL_MIDI_FX_CTRL_5 = 0x19,
    AL_MIDI_FX_CTRL_6 = 0x1A,
    AL_MIDI_FX_CTRL_7 = 0x1B,
    AL_MIDI_FX_CTRL_8 = 0x1C,
    AL_MIDI_FX_CTRL_9 = 0x1D,
    AL_MIDI_SUSTAIN_CTRL = 0x40,
    AL_MIDI_FX1_CTRL = 0x5B,
    AL_MIDI_FX3_CTRL = 0x5D
};
enum AL_MIDImeta {
    AL_MIDI_META_TEMPO = 0x51,
    AL_MIDI_META_EOT = 0x2f
};
typedef struct {
    u8 *curPtr;
    s32 lastTicks;
    s32 curTicks;
    s16 lastStatus;
} ALSeqMarker;
typedef struct {
    s32 ticks;
    u8 status;
    u8 byte1;
    u8 byte2;
    u32 duration;
} ALMIDIEvent;
typedef struct {
    s32 ticks;
    u8 status;
    u8 type;
    u8 len;
    u8 byte1;
    u8 byte2;
    u8 byte3;
} ALTempoEvent;
typedef struct {
    s32 ticks;
    u8 status;
    u8 type;
    u8 len;
} ALEndEvent;
typedef struct {
    struct ALVoice_s *voice;
} ALNoteEvent;
typedef struct {
    struct ALVoice_s *voice;
    ALMicroTime delta;
    u8 vol;
} ALVolumeEvent;
typedef struct {
    s16 vol;
} ALSeqpVolEvent;
typedef struct {
    ALSeqMarker *start;
    ALSeqMarker *end;
    s32 count;
} ALSeqpLoopEvent;
typedef struct {
    u8 chan;
    u8 priority;
} ALSeqpPriorityEvent;
typedef struct {
    void *seq;
} ALSeqpSeqEvent;
typedef struct {
    ALBank *bank;
} ALSeqpBankEvent;
typedef struct {
    struct ALVoiceState_s *vs;
    void *oscState;
    u8 chan;
} ALOscEvent;
typedef struct {
    s16 type;
    union {
        ALMIDIEvent midi;
        ALTempoEvent tempo;
        ALEndEvent end;
        ALNoteEvent note;
        ALVolumeEvent vol;
        ALSeqpLoopEvent loop;
        ALSeqpVolEvent spvol;
 ALSeqpPriorityEvent sppriority;
 ALSeqpSeqEvent spseq;
 ALSeqpBankEvent spbank;
        ALOscEvent osc;
    } msg;
} ALEvent;
typedef struct {
    ALLink node;
    ALMicroTime delta;
    ALEvent evt;
} ALEventListItem;
typedef struct {
    ALLink freeList;
    ALLink allocList;
    s32 eventCount;
} ALEventQueue;
void alEvtqNew(ALEventQueue *evtq, ALEventListItem *items,
                          s32 itemCount);
ALMicroTime alEvtqNextEvent(ALEventQueue *evtq, ALEvent *evt);
void alEvtqPostEvent(ALEventQueue *evtq, ALEvent *evt,
                                ALMicroTime delta);
void alEvtqFlush(ALEventQueue *evtq);
void alEvtqFlushType(ALEventQueue *evtq, s16 type);
typedef struct ALVoiceState_s {
    struct ALVoiceState_s *next;
    ALVoice voice;
    ALSound *sound;
    ALMicroTime envEndTime;
    f32 pitch;
    f32 vibrato;
    u8 envGain;
    u8 channel;
    u8 key;
    u8 velocity;
    u8 envPhase;
    u8 phase;
    u8 tremelo;
    u8 flags;
} ALVoiceState;
typedef struct {
    ALInstrument *instrument;
    s16 bendRange;
    ALFxId fxId;
    ALPan pan;
    u8 priority;
    u8 vol;
    u8 fxmix;
    u8 sustain;
    f32 pitchBend;
} ALChanState;
typedef struct ALSeq_s {
    u8 *base;
    u8 *trackStart;
    u8 *curPtr;
    s32 lastTicks;
    s32 len;
    f32 qnpt;
    s16 division;
    s16 lastStatus;
} ALSeq;
typedef struct {
    u32 trackOffset[16];
    u32 division;
} ALCMidiHdr;
typedef struct ALCSeq_s {
    ALCMidiHdr *base;
    u32 validTracks;
    f32 qnpt;
    u32 lastTicks;
    u32 lastDeltaTicks;
    u32 deltaFlag;
    u8 *curLoc[16];
    u8 *curBUPtr[16];
    u8 curBULen[16];
    u8 lastStatus[16];
    u32 evtDeltaTicks[16];
} ALCSeq;
typedef struct {
    u32 validTracks;
    s32 lastTicks;
    u32 lastDeltaTicks;
    u8 *curLoc[16];
    u8 *curBUPtr[16];
    u8 curBULen[16];
    u8 lastStatus[16];
    u32 evtDeltaTicks[16];
} ALCSeqMarker;
typedef struct {
    s32 maxVoices;
    s32 maxEvents;
    u8 maxChannels;
    u8 debugFlags;
    ALHeap *heap;
    void *initOsc;
    void *updateOsc;
    void *stopOsc;
} ALSeqpConfig;
typedef ALMicroTime (*ALOscInit)(void **oscState,f32 *initVal, u8 oscType,
                                   u8 oscRate, u8 oscDepth, u8 oscDelay);
typedef ALMicroTime (*ALOscUpdate)(void *oscState, f32 *updateVal);
typedef void (*ALOscStop)(void *oscState);
typedef struct {
    ALPlayer node;
    ALSynth *drvr;
    ALSeq *target;
    ALMicroTime curTime;
    ALBank *bank;
    s32 uspt;
    s32 nextDelta;
    s32 state;
    u16 chanMask;
    s16 vol;
    u8 maxChannels;
    u8 debugFlags;
    ALEvent nextEvent;
    ALEventQueue evtq;
    ALMicroTime frameTime;
    ALChanState *chanState;
    ALVoiceState *vAllocHead;
    ALVoiceState *vAllocTail;
    ALVoiceState *vFreeList;
    ALOscInit initOsc;
    ALOscUpdate updateOsc;
    ALOscStop stopOsc;
    ALSeqMarker *loopStart;
    ALSeqMarker *loopEnd;
    s32 loopCount;
} ALSeqPlayer;
typedef struct {
    ALPlayer node;
    ALSynth *drvr;
    ALCSeq *target;
    ALMicroTime curTime;
    ALBank *bank;
    s32 uspt;
    s32 nextDelta;
    s32 state;
    u16 chanMask;
    s16 vol;
    u8 maxChannels;
    u8 debugFlags;
    ALEvent nextEvent;
    ALEventQueue evtq;
    ALMicroTime frameTime;
    ALChanState *chanState;
    ALVoiceState *vAllocHead;
    ALVoiceState *vAllocTail;
    ALVoiceState *vFreeList;
    ALOscInit initOsc;
    ALOscUpdate updateOsc;
    ALOscStop stopOsc;
} ALCSPlayer;
void alSeqNew(ALSeq *seq, u8 *ptr, s32 len);
void alSeqNextEvent(ALSeq *seq, ALEvent *event);
s32 alSeqGetTicks(ALSeq *seq);
f32 alSeqTicksToSec(ALSeq *seq, s32 ticks, u32 tempo);
u32 alSeqSecToTicks(ALSeq *seq, f32 sec, u32 tempo);
void alSeqNewMarker(ALSeq *seq, ALSeqMarker *m, u32 ticks);
void alSeqSetLoc(ALSeq *seq, ALSeqMarker *marker);
void alSeqGetLoc(ALSeq *seq, ALSeqMarker *marker);
void alCSeqNew(ALCSeq *seq, u8 *ptr);
void alCSeqNextEvent(ALCSeq *seq,ALEvent *evt);
s32 alCSeqGetTicks(ALCSeq *seq);
f32 alCSeqTicksToSec(ALCSeq *seq, s32 ticks, u32 tempo);
u32 alCSeqSecToTicks(ALCSeq *seq, f32 sec, u32 tempo);
void alCSeqNewMarker(ALCSeq *seq, ALCSeqMarker *m, u32 ticks);
void alCSeqSetLoc(ALCSeq *seq, ALCSeqMarker *marker);
void alCSeqGetLoc(ALCSeq *seq, ALCSeqMarker *marker);
f32 alCents2Ratio(s32 cents);
void alSeqpNew(ALSeqPlayer *seqp, ALSeqpConfig *config);
void alSeqpDelete(ALSeqPlayer *seqp);
void alSeqpSetSeq(ALSeqPlayer *seqp, ALSeq *seq);
ALSeq *alSeqpGetSeq(ALSeqPlayer *seqp);
void alSeqpPlay(ALSeqPlayer *seqp);
void alSeqpStop(ALSeqPlayer *seqp);
s32 alSeqpGetState(ALSeqPlayer *seqp);
void alSeqpSetBank(ALSeqPlayer *seqp, ALBank *b);
void alSeqpSetTempo(ALSeqPlayer *seqp, s32 tempo);
s32 alSeqpGetTempo(ALSeqPlayer *seqp);
s16 alSeqpGetVol(ALSeqPlayer *seqp);
void alSeqpSetVol(ALSeqPlayer *seqp, s16 vol);
void alSeqpLoop(ALSeqPlayer *seqp, ALSeqMarker *start, ALSeqMarker *end, s32 count);
void alSeqpSetChlProgram(ALSeqPlayer *seqp, u8 chan, u8 prog);
s32 alSeqpGetChlProgram(ALSeqPlayer *seqp, u8 chan);
void alSeqpSetChlFXMix(ALSeqPlayer *seqp, u8 chan, u8 fxmix);
u8 alSeqpGetChlFXMix(ALSeqPlayer *seqp, u8 chan);
void alSeqpSetChlVol(ALSeqPlayer *seqp, u8 chan, u8 vol);
u8 alSeqpGetChlVol(ALSeqPlayer *seqp, u8 chan);
void alSeqpSetChlPan(ALSeqPlayer *seqp, u8 chan, ALPan pan);
ALPan alSeqpGetChlPan(ALSeqPlayer *seqp, u8 chan);
void alSeqpSetChlPriority(ALSeqPlayer *seqp, u8 chan, u8 priority);
u8 alSeqpGetChlPriority(ALSeqPlayer *seqp, u8 chan);
void alSeqpSendMidi(ALSeqPlayer *seqp, s32 ticks, u8 status, u8 byte1, u8 byte2);
void alCSPNew(ALCSPlayer *seqp, ALSeqpConfig *config);
void alCSPDelete(ALCSPlayer *seqp);
void alCSPSetSeq(ALCSPlayer *seqp, ALCSeq *seq);
ALCSeq *alCSPGetSeq(ALCSPlayer *seqp);
void alCSPPlay(ALCSPlayer *seqp);
void alCSPStop(ALCSPlayer *seqp);
s32 alCSPGetState(ALCSPlayer *seqp);
void alCSPSetBank(ALCSPlayer *seqp, ALBank *b);
void alCSPSetTempo(ALCSPlayer *seqp, s32 tempo);
s32 alCSPGetTempo(ALCSPlayer *seqp);
s16 alCSPGetVol(ALCSPlayer *seqp);
void alCSPSetVol(ALCSPlayer *seqp, s16 vol);
void alCSPSetChlProgram(ALCSPlayer *seqp, u8 chan, u8 prog);
s32 alCSPGetChlProgram(ALCSPlayer *seqp, u8 chan);
void alCSPSetChlFXMix(ALCSPlayer *seqp, u8 chan, u8 fxmix);
u8 alCSPGetChlFXMix(ALCSPlayer *seqp, u8 chan);
void alCSPSetChlPan(ALCSPlayer *seqp, u8 chan, ALPan pan);
ALPan alCSPGetChlPan(ALCSPlayer *seqp, u8 chan);
void alCSPSetChlVol(ALCSPlayer *seqp, u8 chan, u8 vol);
u8 alCSPGetChlVol(ALCSPlayer *seqp, u8 chan);
void alCSPSetChlPriority(ALCSPlayer *seqp, u8 chan, u8 priority);
u8 alCSPGetChlPriority(ALCSPlayer *seqp, u8 chan);
void alCSPSendMidi(ALCSPlayer *seqp, s32 ticks, u8 status,
                       u8 byte1, u8 byte2);
typedef struct {
    s32 maxSounds;
    s32 maxEvents;
    ALHeap *heap;
} ALSndpConfig;
typedef struct {
    ALPlayer node;
    ALEventQueue evtq;
    ALEvent nextEvent;
    ALSynth *drvr;
    s32 target;
    void *sndState;
    s32 maxSounds;
    ALMicroTime frameTime;
    ALMicroTime nextDelta;
    ALMicroTime curTime;
} ALSndPlayer;
typedef s16 ALSndId;
void alSndpNew(ALSndPlayer *sndp, ALSndpConfig *c);
void alSndpDelete(ALSndPlayer *sndp);
ALSndId alSndpAllocate(ALSndPlayer *sndp, ALSound *sound);
void alSndpDeallocate(ALSndPlayer *sndp, ALSndId id);
void alSndpSetSound(ALSndPlayer *sndp, ALSndId id);
ALSndId alSndpGetSound(ALSndPlayer *sndp);
void alSndpPlay(ALSndPlayer *sndp);
void alSndpPlayAt(ALSndPlayer *sndp, ALMicroTime delta);
void alSndpStop(ALSndPlayer *sndp);
void alSndpSetVol(ALSndPlayer *sndp, s16 vol);
void alSndpSetPitch(ALSndPlayer *sndp, f32 pitch);
void alSndpSetPan(ALSndPlayer *sndp, ALPan pan);
void alSndpSetPriority(ALSndPlayer *sndp, ALSndId id, u8 priority);
void alSndpSetFXMix(ALSndPlayer *sndp, u8 mix);
s32 alSndpGetState(ALSndPlayer *sndp);
typedef struct {
 unsigned char *base;
 int fmt, siz;
 int xsize, ysize;
 int lsize;
 int addr;
 int w, h;
 int s, t;
} Image;
typedef struct {
 float col[3];
 float pos[3];
 float a1, a2;
} PositionalLight;
extern int guLoadTextureBlockMipMap(Gfx **glist, unsigned char *tbuf, Image *im,
  unsigned char startTile, unsigned char pal, unsigned char cms,
  unsigned char cmt, unsigned char masks, unsigned char maskt,
  unsigned char shifts, unsigned char shiftt, unsigned char cfs,
  unsigned char cft);
extern int guGetDPLoadTextureTileSz (int ult, int lrt);
extern void guDPLoadTextureTile (Gfx *glistp, void *timg,
   int texl_fmt, int texl_size,
   int img_width, int img_height,
   int uls, int ult, int lrs, int lrt,
   int palette,
   int cms, int cmt,
   int masks, int maskt,
   int shifts, int shiftt);
extern void guMtxIdent(Mtx *m);
extern void guMtxIdentF(float mf[4][4]);
extern void guOrtho(Mtx *m, float l, float r, float b, float t,
      float n, float f, float scale);
extern void guOrthoF(float mf[4][4], float l, float r, float b, float t,
       float n, float f, float scale);
extern void guFrustum(Mtx *m, float l, float r, float b, float t,
        float n, float f, float scale);
extern void guFrustumF(float mf[4][4], float l, float r, float b, float t,
         float n, float f, float scale);
extern void guPerspective(Mtx *m, u16 *perspNorm, float fovy,
     float aspect, float near, float far, float scale);
extern void guPerspectiveF(float mf[4][4], u16 *perspNorm, float fovy,
      float aspect, float near, float far, float scale);
extern void guLookAt(Mtx *m,
   float xEye, float yEye, float zEye,
   float xAt, float yAt, float zAt,
   float xUp, float yUp, float zUp);
extern void guLookAtF(float mf[4][4], float xEye, float yEye, float zEye,
        float xAt, float yAt, float zAt,
        float xUp, float yUp, float zUp);
extern void guLookAtReflect(Mtx *m, LookAt *l,
   float xEye, float yEye, float zEye,
   float xAt, float yAt, float zAt,
   float xUp, float yUp, float zUp);
extern void guLookAtReflectF(float mf[4][4], LookAt *l,
        float xEye, float yEye, float zEye,
        float xAt, float yAt, float zAt,
        float xUp, float yUp, float zUp);
extern void guLookAtHilite(Mtx *m, LookAt *l, Hilite *h,
                float xEye, float yEye, float zEye,
                float xAt, float yAt, float zAt,
                float xUp, float yUp, float zUp,
                float xl1, float yl1, float zl1,
                float xl2, float yl2, float zl2,
  int twidth, int theight);
extern void guLookAtHiliteF(float mf[4][4], LookAt *l, Hilite *h,
  float xEye, float yEye, float zEye,
  float xAt, float yAt, float zAt,
  float xUp, float yUp, float zUp,
  float xl1, float yl1, float zl1,
  float xl2, float yl2, float zl2,
  int twidth, int theight);
extern void guLookAtStereo(Mtx *m,
   float xEye, float yEye, float zEye,
   float xAt, float yAt, float zAt,
   float xUp, float yUp, float zUp,
   float eyedist);
extern void guLookAtStereoF(float mf[4][4],
         float xEye, float yEye, float zEye,
         float xAt, float yAt, float zAt,
         float xUp, float yUp, float zUp,
   float eyedist);
extern void guRotate(Mtx *m, float a, float x, float y, float z);
extern void guRotateF(float mf[4][4], float a, float x, float y, float z);
extern void guRotateRPY(Mtx *m, float r, float p, float y);
extern void guRotateRPYF(float mf[4][4], float r, float p, float h);
extern void guAlign(Mtx *m, float a, float x, float y, float z);
extern void guAlignF(float mf[4][4], float a, float x, float y, float z);
extern void guScale(Mtx *m, float x, float y, float z);
extern void guScaleF(float mf[4][4], float x, float y, float z);
extern void guTranslate(Mtx *m, float x, float y, float z);
extern void guTranslateF(float mf[4][4], float x, float y, float z);
extern void guPosition(Mtx *m, float r, float p, float h, float s,
         float x, float y, float z);
extern void guPositionF(float mf[4][4], float r, float p, float h, float s,
   float x, float y, float z);
extern void guMtxF2L(float mf[4][4], Mtx *m);
extern void guMtxL2F(float mf[4][4], Mtx *m);
extern void guMtxCatF(float m[4][4], float n[4][4], float r[4][4]);
extern void guMtxCatL(Mtx *m, Mtx *n, Mtx *res);
extern void guMtxXFMF(float mf[4][4], float x, float y, float z,
        float *ox, float *oy, float *oz);
extern void guMtxXFML(Mtx *m, float x, float y, float z,
        float *ox, float *oy, float *oz);
extern void guNormalize(float *x, float *y, float *z);
void guPosLight(PositionalLight *pl, Light *l,
                float xOb, float yOb, float zOb);
void guPosLightHilite(PositionalLight *pl1, PositionalLight *pl2,
                Light *l1, Light *l2,
                LookAt *l, Hilite *h,
                float xEye, float yEye, float zEye,
                float xOb, float yOb, float zOb,
                float xUp, float yUp, float zUp,
                int twidth, int theight);
extern int guRandom(void);
extern float sinf(float angle);
extern float cosf(float angle);
extern signed short sins (unsigned short angle);
extern signed short coss (unsigned short angle);
extern float sqrtf(float value);
#pragma intrinsic sqrtf
extern void guParseRdpDL(u64 *rdp_dl, u64 nbytes, u8 flags);
extern void guParseString(char *StringPointer, u64 nbytes);
extern void
guBlinkRdpDL(u64 *rdp_dl_in, u64 nbytes_in,
             u64 *rdp_dl_out, u64 *nbytes_out,
             u32 x, u32 y, u32 radius,
             u8 red, u8 green, u8 blue,
             u8 flags);
extern void guParseGbiDL(u64 *gbi_dl, u32 nbytes, u8 flags);
extern void guDumpGbiDL(OSTask *tp,u8 flags);
typedef struct {
    int dataSize;
    int dlType;
    int flags;
    u32 paddr;
} guDLPrintCB;
void guSprite2DInit(uSprite *SpritePointer,
      void *SourceImagePointer,
      void *TlutPointer,
      int Stride,
      int SubImageWidth,
      int SubImageHeight,
      int SourceImageType,
      int SourceImageBitSize,
      int SourceImageOffsetS,
      int SourceImageOffsetT);
typedef struct {
    long type;
    long length;
    long magic;
    char userdata[(((4096)*6)-(3*sizeof(long)))];
} RamRomBuffer;
struct bitmap {
 s16 width;
 s16 width_img;
 s16 s;
 s16 t;
 void *buf;
 s16 actualHeight;
 s16 LUToffset;
};
typedef struct bitmap Bitmap;
struct sprite {
 s16 x,y;
 s16 width, height;
 f32 scalex, scaley;
 s16 expx, expy;
 u16 attr;
 s16 zdepth;
 u8 red;
 u8 green;
 u8 blue;
 u8 alpha;
 s16 startTLUT;
 s16 nTLUT;
 int *LUT;
 s16 istart;
 s16 istep;
 s16 nbitmaps;
 s16 ndisplist;
 s16 bmheight;
 s16 bmHreal;
 u8 bmfmt;
 u8 bmsiz;
 Bitmap *bitmap;
 Gfx *rsp_dl;
 Gfx *rsp_dl_next;
 s16 frac_s,
  frac_t;
};
typedef struct sprite Sprite;
void spSetAttribute (Sprite *sp, s32 attr);
void spClearAttribute (Sprite *sp, s32 attr);
void spX2Move (Sprite *sp, s32 x, s32 y);
void spScale (Sprite *sp, f32 sx, f32 sy);
void spX2SetZ (Sprite *sp, s32 z );
void spColor (Sprite *sp, u8 red, u8 green, u8 blue, u8 alpha);
Gfx *spX2Draw (Sprite *sp);
void spX2Init( Gfx **glistp );
void spX2Scissor( s32 xmin, s32 xmax, s32 ymin, s32 ymax );
void spX2Finish( Gfx **glistp );
extern long long int rspbootTextStart[], rspbootTextEnd[];
extern long long int gspFast3DTextStart[], gspFast3DTextEnd[];
extern long long int gspFast3DDataStart[], gspFast3DDataEnd[];
extern long long int gspFast3D_dramTextStart[], gspFast3D_dramTextEnd[];
extern long long int gspFast3D_dramDataStart[], gspFast3D_dramDataEnd[];
extern long long int gspFast3D_fifoTextStart[], gspFast3D_fifoTextEnd[];
extern long long int gspFast3D_fifoDataStart[], gspFast3D_fifoDataEnd[];
extern long long int gspF3DNoNTextStart[], gspF3DNoNTextEnd[];
extern long long int gspF3DNoNDataStart[], gspF3DNoNDataEnd[];
extern long long int gspF3DNoN_dramTextStart[];
extern long long int gspF3DNoN_dramTextEnd[];
extern long long int gspF3DNoN_dramDataStart[];
extern long long int gspF3DNoN_dramDataEnd[];
extern long long int gspF3DNoN_fifoTextStart[];
extern long long int gspF3DNoN_fifoTextEnd[];
extern long long int gspF3DNoN_fifoDataStart[];
extern long long int gspF3DNoN_fifoDataEnd[];
extern long long int gspLine3DTextStart[], gspLine3DTextEnd[];
extern long long int gspLine3DDataStart[], gspLine3DDataEnd[];
extern long long int gspLine3D_dramTextStart[], gspLine3D_dramTextEnd[];
extern long long int gspLine3D_dramDataStart[], gspLine3D_dramDataEnd[];
extern long long int gspLine3D_fifoTextStart[], gspLine3D_fifoTextEnd[];
extern long long int gspLine3D_fifoDataStart[], gspLine3D_fifoDataEnd[];
extern long long int gspSprite2DTextStart[], gspSprite2DTextEnd[];
extern long long int gspSprite2DDataStart[], gspSprite2DDataEnd[];
extern long long int gspSprite2D_dramTextStart[], gspSprite2D_dramTextEnd[];
extern long long int gspSprite2D_dramDataStart[], gspSprite2D_dramDataEnd[];
extern long long int gspSprite2D_fifoTextStart[], gspSprite2D_fifoTextEnd[];
extern long long int gspSprite2D_fifoDataStart[], gspSprite2D_fifoDataEnd[];
extern long long int aspMainTextStart[], aspMainTextEnd[];
extern long long int aspMainDataStart[], aspMainDataEnd[];
extern long long int gspF3DEX_fifoTextStart[], gspF3DEX_fifoTextEnd[];
extern long long int gspF3DEX_fifoDataStart[], gspF3DEX_fifoDataEnd[];
extern long long int gspF3DEX_NoN_fifoTextStart[], gspF3DEX_NoN_fifoTextEnd[];
extern long long int gspF3DEX_NoN_fifoDataStart[], gspF3DEX_NoN_fifoDataEnd[];
extern long long int gspF3DLX_fifoTextStart[], gspF3DLX_fifoTextEnd[];
extern long long int gspF3DLX_fifoDataStart[], gspF3DLX_fifoDataEnd[];
extern long long int gspF3DLX_NoN_fifoTextStart[], gspF3DLX_NoN_fifoTextEnd[];
extern long long int gspF3DLX_NoN_fifoDataStart[], gspF3DLX_NoN_fifoDataEnd[];
extern long long int gspF3DLX_Rej_fifoTextStart[], gspF3DLX_Rej_fifoTextEnd[];
extern long long int gspF3DLX_Rej_fifoDataStart[], gspF3DLX_Rej_fifoDataEnd[];
extern long long int gspF3DLP_Rej_fifoTextStart[], gspF3DLP_Rej_fifoTextEnd[];
extern long long int gspF3DLP_Rej_fifoDataStart[], gspF3DLP_Rej_fifoDataEnd[];
extern long long int gspL3DEX_fifoTextStart[], gspL3DEX_fifoTextEnd[];
extern long long int gspL3DEX_fifoDataStart[], gspL3DEX_fifoDataEnd[];
extern long long int gspF3DEX2_fifoTextStart[], gspF3DEX2_fifoTextEnd[];
extern long long int gspF3DEX2_fifoDataStart[], gspF3DEX2_fifoDataEnd[];
extern long long int gspF3DEX2_NoN_fifoTextStart[],gspF3DEX2_NoN_fifoTextEnd[];
extern long long int gspF3DEX2_NoN_fifoDataStart[],gspF3DEX2_NoN_fifoDataEnd[];
extern long long int gspF3DEX2_Rej_fifoTextStart[],gspF3DEX2_Rej_fifoTextEnd[];
extern long long int gspF3DEX2_Rej_fifoDataStart[],gspF3DEX2_Rej_fifoDataEnd[];
extern long long int gspF3DLX2_Rej_fifoTextStart[],gspF3DLX2_Rej_fifoTextEnd[];
extern long long int gspF3DLX2_Rej_fifoDataStart[],gspF3DLX2_Rej_fifoDataEnd[];
extern long long int gspL3DEX2_fifoTextStart[], gspL3DEX2_fifoTextEnd[];
extern long long int gspL3DEX2_fifoDataStart[], gspL3DEX2_fifoDataEnd[];
extern long long int gspF3DEX2_xbusTextStart[], gspF3DEX2_xbusTextEnd[];
extern long long int gspF3DEX2_xbusDataStart[], gspF3DEX2_xbusDataEnd[];
extern long long int gspF3DEX2_NoN_xbusTextStart[],gspF3DEX2_NoN_xbusTextEnd[];
extern long long int gspF3DEX2_NoN_xbusDataStart[],gspF3DEX2_NoN_xbusDataEnd[];
extern long long int gspF3DEX2_Rej_xbusTextStart[],gspF3DEX2_Rej_xbusTextEnd[];
extern long long int gspF3DEX2_Rej_xbusDataStart[],gspF3DEX2_Rej_xbusDataEnd[];
extern long long int gspF3DLX2_Rej_xbusTextStart[],gspF3DLX2_Rej_xbusTextEnd[];
extern long long int gspF3DLX2_Rej_xbusDataStart[],gspF3DLX2_Rej_xbusDataEnd[];
extern long long int gspL3DEX2_xbusTextStart[], gspL3DEX2_xbusTextEnd[];
extern long long int gspL3DEX2_xbusDataStart[], gspL3DEX2_xbusDataEnd[];
typedef void (*OSErrorHandler)(s16, s16, ...);
OSErrorHandler osSetErrorHandler(OSErrorHandler);
typedef struct {
    u32 magic;
    u32 len;
    u32 *base;
    s32 startCount;
    s32 writeOffset;
} OSLog;
typedef struct {
    u32 magic;
    u32 timeStamp;
    u16 argCount;
    u16 eventID;
} OSLogItem;
typedef struct {
    u32 magic;
    u32 version;
} OSLogFileHdr;
void osCreateLog(OSLog *log, u32 *base, s32 len);
void osLogEvent(OSLog *log, s16 code, s16 numArgs, ...);
void osFlushLog(OSLog *log);
u32 osLogFloat(f32);
extern void osDelay(int count);
typedef struct {
              s16 x;
              s16 z;
} Vec2s;
typedef struct {
              f32 x;
              f32 z;
} Vec2f;

typedef struct {
              u16 x;
              u16 y;
              u16 z;
} Vec3us;
typedef struct {
              s32 x;
              s32 y;
              s32 z;
} Vec3i;

typedef struct {
    u32 cont:   1;
    u32 type:   4;
    u32 offset: 11;
    s32 value:  16;
} ValueSet;

typedef struct xyz_t{
    f32 x,y,z;
}xyz_t;



typedef struct s_xyz{
    s16 x,y,z;
}s_xyz;

typedef float MtxF_t[4][4];
typedef union {
    MtxF_t mf;
    struct {
        float xx, yx, zx, wx, xy, yy, zy, wy, xz, yz, zz, wz, xw, yw, zw, ww;
    };
} MtxF;
typedef s32 (*UNK_FUN_PTR)();
struct Game_Play;
void mem_copy(u8* dst, u8* src, u32 size);
s32 mem_clear(u8* ptr, size_t size, u8 value);
f32 cos_s(s16 angle);
f32 sin_s(s16 angle);
s32 chase_f(f32* arg0, f32 arg1, f32 arg2);
void xyz_t_move(xyz_t* dst, xyz_t* src);
void xyz_t_move_s_xyz(xyz_t* dst, s_xyz* src);
f32 search_position_distanceXZ(xyz_t* arg0, xyz_t* arg1);
s16 search_position_angleY(xyz_t* arg0, xyz_t* arg1);
f32 add_calc(f32* pValue, f32 target, f32 fraction, f32 maxStep, f32 minStep);
s32 none_proc1(void);
s32 _Game_play_isPause(struct Game_Play* game_play);
void *Lib_SegmentedToVirtual(void *ptr);
f32 check_percent_abs(f32 x, f32 min, f32 max, f32 scale, s32 shift_by_min);
typedef signed int intptr_t;
typedef unsigned int uintptr_t;
typedef struct TwoHeadArena {
               size_t size;
               void* start;
               void* head;
               void* tail;
} TwoHeadArena;
void* THA_getHeadPtr(TwoHeadArena* tha);
void THA_setHeadPtr(TwoHeadArena* tha, void* newHead);
void* THA_getTailPtr(TwoHeadArena* tha);
void* THA_nextPtrN(TwoHeadArena* tha, size_t size);
void* THA_nextPtr1(TwoHeadArena* tha);
void* THA_alloc(TwoHeadArena* tha, size_t size);
void* THA_alloc16(TwoHeadArena* tha, size_t size);
void* THA_allocAlign(TwoHeadArena* tha, size_t size, uintptr_t mask);
s32 THA_getFreeBytes(TwoHeadArena* tha);
u32 THA_isCrash(TwoHeadArena* tha);
void THA_init(TwoHeadArena* tha);
void THA_ct(TwoHeadArena* tha, void* start, size_t size);
void THA_dt(TwoHeadArena* tha);
typedef union TwoHeadGfxArena {
    struct {
                  size_t size;
                  void* start;
                  Gfx* p;
                  void* d;
    };
              TwoHeadArena tha;
} TwoHeadGfxArena;
void THA_GA_ct(TwoHeadGfxArena* thga, void* start, size_t size);
void THGA_dt(TwoHeadGfxArena* thga);
u32 THA_GA_isCrash(TwoHeadGfxArena* thga);
void THA_GA_init(TwoHeadGfxArena* thga);
s32 THA_GA_getFreeBytes(TwoHeadGfxArena* thga);
Gfx* THA_GA_getHeadPtr(TwoHeadGfxArena* thga);
void THA_GA_setHeadPtr(TwoHeadGfxArena* thga, Gfx* newHead);
void* THA_GA_getTailPtr(TwoHeadGfxArena* thga);
Gfx* THA_GA_nextPtrN(TwoHeadGfxArena* thga, size_t num);
Gfx* THA_GA_nextPtr1(TwoHeadGfxArena* thga);
Gfx* THA_GA_NEXT_DISP(TwoHeadGfxArena* thga);
void* THA_GA_alloc(TwoHeadGfxArena* thga, size_t size);
Mtx* THA_GA_allocMtxN(TwoHeadGfxArena* thga, size_t num);
Mtx* THA_GA_allocMtx1(TwoHeadGfxArena* thga);
Vtx* THA_GA_allocVtxN(TwoHeadGfxArena* thga, u32 num);
Vtx* THA_GA_allocVtx1(TwoHeadGfxArena* thga);

typedef struct OSScTask {
    /* 0x00 */ struct OSScTask* next;
    /* 0x04 */ u32              state;
    /* 0x08 */ u32              flags;
    /* 0x0C */ void*            framebuffer;
    /* 0x10 */ OSTask           list;
    /* 0x50 */ OSMesgQueue*     msgQ;
    /* 0x54 */ OSMesg           msg;
} OSScTask; // size = 0x58

typedef struct {
    /* 0x00 */ u16* fb1;
    /* 0x04 */ u16* swapBuffer;
    /* 0x08 */ u8 unk8;
    /* 0x09 */ u8 unk9;
    /* 0x0A */ u8 unkA; 
    /* 0x0B */ u8 unkB;
    /* 0x0C */ OSViMode* viMode;
    /* 0x10 */ u32 unk10;
    /* 0x14 */ f32 xScale;
    /* 0x18 */ f32 yScale;
} CfbInfo; // size = 0x1C

typedef void (*GraphicsCallback)(struct GraphicsContext*, void*);
typedef struct GraphicsContext {
                Gfx* polyOpaBuffer;
                Gfx* polyXluBuffer;
                void* unk_008;
                void* unk_00C;
                Gfx* overlayBuffer;
                Gfx* fontBuffer;
                Gfx* shadowBuffer;
                Gfx* lightBuffer;
                Gfx* gfxSave;
                s8 unk_024[0x20];
                OSMesg graphReplyMesgBuf[8];
                OSMesgQueue* schedMesgQueue;
                OSMesgQueue graphReplyMesgQueue;
                OSScTask task;
                /* 0x0D4 */ char unk_D4[0xB0];
                Gfx* workBuffer;
                TwoHeadGfxArena work;
                s8 unk_190[0xC0]; 
                OSViMode* unk_25C;
                s8 unk_260[0x20];
                TwoHeadGfxArena overlay;
                TwoHeadGfxArena polyOpa;
                TwoHeadGfxArena polyXlu;
                TwoHeadGfxArena font;
                TwoHeadGfxArena shadow;
                TwoHeadGfxArena light;
                s32 frameCounter;
                u16* unk_2E4;
                s8 unk_2E8[0x4];
                u32 unk_2EC;
                u8 unk_2F0;
                s8 unk_2F1[0x1];
                u8 unk_2F2;
                u8 cfbBank;
                GraphicsCallback unk_2F4;
                void* unk_2F8; 
                f32 unk_2FC;
                f32 unk_300;
                Gfx* unk_304;
}GraphicsContext;
typedef struct Sphere {
              s_xyz center;
              s16 radius;
} Sphere;
typedef struct Triangle {
               xyz_t vertices[3];
} Triangle;
typedef struct Triangle3 {
               Triangle unk_00;
               xyz_t unk_24;
               f32 unk_30;
} Triangle3;
typedef struct Pipe {
              s16 radius;
              s16 unk_2;
              s16 yShift;
              s_xyz pos;
} Pipe;
void Math3DPlane(xyz_t* arg0, xyz_t* arg1, xyz_t* arg2, f32* arg3, f32* arg4, f32* arg5, f32* arg6);
s32 Math3D_sphereCrossTriangle3_cp(Sphere* sphere, Triangle3* triangle3, xyz_t* arg2);
s32 Math3D_pipeCrossTriangle_cp(Pipe* pipe, Triangle* arg1, xyz_t* arg2);
s32 Math3D_sphereCrossSphere_cl(Sphere* sphere1, Sphere* sphere2, f32* arg2);
s32 Math3D_sphereVsPipe_cl(Sphere* sphere, Pipe* pipe, f32* arg2);
s32 Math3D_pipeVsPipe_cl(Pipe* pipe1, Pipe* pipe2, f32* arg2);
extern xyz_t ZeroVec;
struct Actor;
struct Game_Play;
typedef enum ColliderShape {
            COLSHAPE_JNTSPH,
            COLSHAPE_PIPE,
            COLSHAPE_TRIS,
            COLSHAPE_MAX
} ColliderShape;
typedef enum ColMassType {
            MASSTYPE_IMMOVABLE,
            MASSTYPE_HEAVY,
            MASSTYPE_NORMAL
} ColMassType;
typedef struct ClObjElem {
              u8 flags;
} ClObjElem;
typedef struct ClObj_Properties {
              u8 ocFlags1;
              u8 ocFlags2;
              u8 shape;
} ClObj_Properties;
typedef struct ClObj {
              struct Actor* actor;
              struct Actor* oc;
              ClObj_Properties prop;
} ClObj;
typedef struct ClObjJntSphElemAttr_Init {
              u8 unk_0;
              Sphere unk_2;
              s16 unk_A;
} ClObjJntSphElemAttr_Init;
typedef struct ClObjJntSphElem_Init {
              ClObjElem elem;
              ClObjJntSphElemAttr_Init attr;
} ClObjJntSphElem_Init;
typedef struct ClObjJntSph_Init {
              ClObj_Properties prop;
              s32 count;
              ClObjJntSphElem_Init* elements;
} ClObjJntSph_Init;
typedef struct ClObjJntSphElemAttr {
               Sphere unk_00;
               Sphere unk_08;
               f32 unk_10;
               u8 unk_14;
} ClObjJntSphElemAttr;
typedef struct ClObjJntSphElem {
               ClObjElem elem;
               ClObjJntSphElemAttr attr;
} ClObjJntSphElem;
typedef struct ClObjJntSph {
               ClObj base;
               s32 count;
               ClObjJntSphElem* elements;
} ClObjJntSph;
typedef struct ClObjPipeAttr {
              Pipe dim;
} ClObjPipeAttr;
typedef struct ClObjPipe_Init {
              ClObj_Properties prop;
              ClObjElem elem;
              ClObjPipeAttr attr;
} ClObjPipe_Init;
typedef struct ClObjPipe {
               ClObj base;
               ClObjElem element;
               ClObjPipeAttr attribute;
} ClObjPipe;
typedef struct ClObjTrisElemAttr_Init {
               Triangle unk_00;
} ClObjTrisElemAttr_Init;
typedef struct ClObjTrisElemAttr {
               Triangle3 unk_00;
               xyz_t unk_34;
} ClObjTrisElemAttr;
typedef struct ClObjTrisElem {
               ClObjElem elem;
               ClObjTrisElemAttr attr;
} ClObjTrisElem;
typedef struct ClObjTris {
               ClObj base;
               s32 count;
               ClObjTrisElem* elements;
} ClObjTris;
typedef struct ClObjTrisElem_Init {
               ClObjElem elem;
               ClObjTrisElemAttr_Init attr;
} ClObjTrisElem_Init;
typedef struct ClObjTris_Init {
              ClObj_Properties prop;
              s32 count;
              ClObjTrisElem_Init* elem;
} ClObjTris_Init;
typedef struct CollisionCheck {
               u16 flags;
               s32 ocColCount;
               ClObj *ocColliders[50];
} CollisionCheck;
typedef struct CollisionCheck_Status_Init {
              u8 unk_0;
              s16 unk_2;
              s16 unk_4;
              s16 unk_6;
              u8 mass;
} CollisionCheck_Status_Init;
typedef struct CollisionCheck_Status {
               xyz_t displacement;
               s16 unk_0C;
               s16 unk_0E;
               s16 unk_10;
               u8 mass;
               u8 unk_13;
               u8 unk_14;
               u8 unk_15;
               u8 unk_16;
               u8 unk_17;
} CollisionCheck_Status;
s32 ClObjJntSph_ct(struct Game_Play* game_play, ClObjJntSph* colJntSph);
s32 ClObjJntSph_dt_nzf(struct Game_Play* game_play, ClObjJntSph* colJntSph);
s32 ClObjJntSph_set5_nzm(struct Game_Play* game_play, ClObjJntSph* colJntSph, struct Actor* actor, ClObjJntSph_Init* init, ClObjJntSphElem elements[]);
s32 ClObjPipe_ct(struct Game_Play* game_play, ClObjPipe* colPipe);
s32 ClObjPipe_dt(struct Game_Play* game_play, ClObjPipe* colPipe);
s32 ClObjPipe_set5(struct Game_Play* game_play, ClObjPipe* colPipe, struct Actor* actor, ClObjPipe_Init* init);
s32 ClObjTris_ct(struct Game_Play* game_play, ClObjTris* colTris);
s32 ClObjTris_dt_nzf(struct Game_Play* game_play, ClObjTris* colTris);
s32 ClObjTris_set5_nzm(struct Game_Play* game_play, ClObjTris* colTris, struct Actor* actor, ClObjTris_Init* init, ClObjTrisElem elements[]);
void CollisionCheck_ct(struct Game_Play* game_play, CollisionCheck* colCheck);
void CollisionCheck_dt(struct Game_Play* game_play, CollisionCheck* arg1);
void CollisionCheck_clear(struct Game_Play* game_play, CollisionCheck* colCheck);
s32 CollisionCheck_setOC(struct Game_Play* game_play, CollisionCheck* colCheck, ClObj* cl);
void CollisionCheck_OC(struct Game_Play* game_play, CollisionCheck* colCheck);
void CollisionCheck_OCC(struct Game_Play* game_play, CollisionCheck* colCheck);
s32 CollisionCheck_setOCC(struct Game_Play* game_play, CollisionCheck* colCheck, ClObj* cl);
void CollisionCheck_Status_ct(CollisionCheck_Status* status);
void CollisionCheck_Status_Clear(CollisionCheck_Status* status);
void CollisionCheck_Status_set3(CollisionCheck_Status* status, CollisionCheck_Status_Init* init);
void CollisionCheck_Uty_ActorWorldPosSetPipeC(struct Actor* actor, ClObjPipe* colPipe);
s32 CollisionCheck_Uty_setTrisPos_ad(struct Game_Play* game_play, ClObjTris* colTris, s32 index, ClObjTrisElemAttr_Init* init);
typedef struct mEv_event_save_c {
               char unk00[0x9C];
} mEv_event_save_c;
typedef struct Event {
               u8 unk_00;
               u8 unk_01;
               u8 unk_02;
               u8 unk_03;
               s16 unk_04;
               s16 unk_06;
               s32 unk_08;
               s32 unk_0C;
} Event;
void mEv_ClearEventSaveInfo(mEv_event_save_c* event_save);
void mEv_ClearEventInfo(void);
s32 mEv_CheckFirstJob(void);
s32 mEv_CheckFirstIntro(void);
void mEv_SetGateway(void);
void mEv_UnSetGateway(void);
s32 mEv_CheckTitleDemo(void);
void mEv_init(Event* event);
void mEv_init_force(void*);
void mEv_2nd_init(Event* event);
void mEv_run(Event* event);
void mEv_finish(Event* event);
void mEv_clear_status(s32, s16);
s32 mEv_check_status(s32, s16);
typedef struct LandName {
              s8 unk_0[0x6];
} LandName;
void mLd_CopyLandName(LandName* arg0, LandName* arg1);
void mLd_LandDataInit(void);
struct Private_c;
struct mPr_map_info_c;
struct mLd_land_info_c;
struct mPr_mother_mail_info_c;
typedef struct PlayerName {
              s8 unk_0[0x6];
} PlayerName;
typedef struct PersonalID {
              PlayerName unk_0;
              LandName unk_6;
              u16 unk_C;
              u16 unk_E;
} PersonalID;
void mPr_CopyPlayerName(PlayerName* dst, PlayerName* src);
void mPr_ClearPersonalID(PersonalID* arg0);
void mPr_CopyPersonalID(PersonalID* arg0, PersonalID* arg1);
s32 mPr_CheckCmpPersonalID(PersonalID* arg0, PersonalID* arg1);
void mPr_ClearPrivateInfo(struct Private_c* private);
void mPr_InitPrivateInfo(struct Private_c* private);
s32 mPr_CheckPrivate(struct Private_c* private);
void mPr_SetPossessionItem(struct Private_c* priv, int idx, u16 item, u32 cond);
s32 func_800B8D64_jp(u8 player_no, s32 arg1);
void mPr_ClearMotherMailInfo(struct mPr_mother_mail_info_c* arg0);
void func_800B9B2C_jp(void);
void mPr_SendForeingerAnimalMail(struct Private_c* now_private);
void mPr_StartSetCompleteTalkInfo(void);
void mPr_RenewalMapInfo(struct mPr_map_info_c* maps, s32 count, struct mLd_land_info_c* land_info);
struct struct_func_8085CE18_jp_arg4;
typedef struct mMl_get_npcinfo_from_mail_name_arg0 {
              u16 unk_0;
              u16 unk_2;
              LandName unk_4;
              u8 unk_A;
              u8 unk_B;
              u8 unk_C;
} mMl_get_npcinfo_from_mail_name_arg0;
typedef struct mMl_unk_00 {
               PersonalID unk_00;
               u8 unk_10;
} mMl_unk_00;
typedef struct mMl_unk_2A {
               s8 unk_00[0x7A];
} mMl_unk_2A;
typedef struct MailHeaderCommon {
               s8 unk_00;
               u8 unk_01;
               u8 unk_02[10];
               u8 unk_0C[16];
} MailHeaderCommon;
typedef struct Mail {
               mMl_unk_00 unk_00;
               mMl_unk_00 unk_12;
               s8 unk_24[0x2];
               u8 unk_26;
               s8 unk_27[0x1];
               u8 unk_28;
               u8 unk_29;
               mMl_unk_2A unk_2A;
} Mail;
s32 mMl_strlen(const char* arg0, s32 size, char c);
s32 mMl_strlen2(s32* arg0, const char* arg1, s32 size, char c);
void mMl_strcpy_back(char* dst, const char* src, s32 size);
void mMl_clear_mail_header(Mail* mail);
void mMl_clear_mail(Mail* mail);
void mMl_clear_mail_box(Mail* mail, s32 arg1);
s32 mMl_check_not_used_mail(Mail* mail);
void mMl_copy_header_name(mMl_unk_00* arg0, mMl_unk_00* arg1);
void mMl_set_from_name(Mail* arg0, Mail* arg1);
void mMl_set_to_name(Mail* arg0, Mail* arg1);
void mMl_set_to_plname(Mail* arg0, Mail* arg1);
void mMl_set_playername(Mail* mail, PersonalID* arg1);
void mMl_init_mail(Mail* mail, PersonalID* arg1);
s32 mMl_chk_mail_free_space(Mail mail[], s32 arg1);
s32 mMl_use_mail_space(Mail mail[], s32 arg1, PersonalID* arg2);
s32 mMl_count_use_mail_space(Mail mail[], s32 arg1);
void mMl_copy_mail(Mail* dst, Mail* src);
void mMl_clear_mail_header_common(MailHeaderCommon* arg0);
void mMl_copy_mail_header_common(MailHeaderCommon* arg0, MailHeaderCommon* arg1);
void mMl_set_mail_name_npcinfo(mMl_unk_00* arg0, mMl_get_npcinfo_from_mail_name_arg0* arg1);
s32 mMl_get_npcinfo_from_mail_name(mMl_get_npcinfo_from_mail_name_arg0* arg0, mMl_unk_00* arg1);
s32 mMl_hunt_for_send_address(Mail* mail);
s32 mMl_check_send_mail(struct struct_func_8085CE18_jp_arg4* arg0);
s32 mMl_check_set_present_myself(Mail* mail);
typedef u32 RomOffset;
typedef void* TexturePtr;
struct Game_Play;
struct Submenu;
struct struct_8085E9B0;
typedef enum mSMMoveProcIndex {
            MSM_MOVE_PROC_WAIT,
            MSM_MOVE_PROC_PREWAIT,
            MSM_MOVE_PROC_LINKWAIT,
            MSM_MOVE_PROC_PLAY,
            MSM_MOVE_PROC_END,
            MSM_MOVE_PROC_MAX
} mSMMoveProcIndex;
typedef enum InventoryItemList {
             INVENTORY_ITEM_LIST_0,
             INVENTORY_ITEM_LIST_1,
             INVENTORY_ITEM_LIST_ENTRUST,
             INVENTORY_ITEM_LIST_3,
             INVENTORY_ITEM_LIST_4,
             INVENTORY_ITEM_LIST_SELL,
             INVENTORY_ITEM_LIST_GIVE,
             INVENTORY_ITEM_LIST_7,
             INVENTORY_ITEM_LIST_TAKE,
             INVENTORY_ITEM_LIST_FURNITURE,
             INVENTORY_ITEM_LIST_MINIDISK,
             INVENTORY_ITEM_LIST_SHRINE,
             INVENTORY_ITEM_LIST_C,
             INVENTORY_ITEM_LIST_ECHANGE,
             INVENTORY_ITEM_LIST_E,
             INVENTORY_ITEM_LIST_F,
             INVENTORY_ITEM_LIST_MAX
} InventoryItemList;
typedef enum SubmenuProgramId {
             SUBMENU_PROGRAM_0,
             SUBMENU_PROGRAM_1,
             SUBMENU_PROGRAM_2,
             SUBMENU_PROGRAM_3,
             SUBMENU_PROGRAM_LEDIT,
             SUBMENU_PROGRAM_MAP,
             SUBMENU_PROGRAM_6,
             SUBMENU_PROGRAM_7,
             SUBMENU_PROGRAM_8,
             SUBMENU_PROGRAM_9,
             SUBMENU_PROGRAM_10,
             SUBMENU_PROGRAM_11,
             SUBMENU_PROGRAM_BOARD,
             SUBMENU_PROGRAM_13,
             SUBMENU_PROGRAM_14,
             SUBMENU_PROGRAM_15,
             SUBMENU_PROGRAM_16,
             SUBMENU_PROGRAM_17,
             SUBMENU_PROGRAM_18,
             SUBMENU_PROGRAM_19,
             SUBMENU_PROGRAM_CATALOG,
             SUBMENU_PROGRAM_MAX,
} SubmenuProgramId;
typedef void (*SubmenuMoveFunc)(struct Submenu*);
typedef void (*SubmenuDrawFunc)(struct Submenu*, struct Game_Play*);
typedef struct Submenu {
               s32 unk_00;
               SubmenuProgramId programId;
               SubmenuProgramId unk_08;
               mSMMoveProcIndex moveProcIndex;
               s32 unk_10;
               s32 unk_14;
               s32 unk_18;
               s32 unk_1C;
               s32 unk_20;
               void* linkedAllocStart;
               void* linkedAllocEnd;
               struct struct_8085E9B0* unk_2C;
               SubmenuMoveFunc move;
               SubmenuDrawFunc draw;
               Mail mail;
               u8 unk_DC;
               u8 unk_DD;
               u8 unk_DE;
               u8 unk_DF;
               u16 unk_E0;
               u8 unk_E2;
               u8 unk_E3;
               xyz_t unk_E4;
} Submenu;
s32 SubmenuArea_IsPlayer(void);
void* mSM_ovlptr_dllcnv(void* vram, Submenu* submenu);
void mSM_submenu_ovlptr_init(struct Game_Play* game_play);
void mSM_submenu_ovlptr_cleanup(Submenu* submenu);
void load_player(Submenu* submenu);
void mSM_submenu_ct(Submenu* submenu);
void mSM_submenu_dt(Submenu* submenu);
void mSM_open_submenu(Submenu* submenu, SubmenuProgramId programId, s32 arg2, s32 arg3);
void mSM_open_submenu_new(Submenu* submenu, SubmenuProgramId programId, s32 arg2, s32 arg3, s32 arg4);
void mSM_open_submenu_new2(Submenu* submenu, SubmenuProgramId programId, s32 arg2, s32 arg3, s32 arg4, s32 arg5);
void mSM_submenu_ctrl(struct Game_Play* game_play);
void mSM_submenu_move(Submenu* submenu);
void mSM_submenu_draw(Submenu* submenu, struct Game_Play* game_play);
u32 mSM_check_open_inventory_itemlist(InventoryItemList itemlist, s32 arg1) ;
typedef struct GameAllocEntry {
              struct GameAllocEntry* next;
              struct GameAllocEntry* prev;
              size_t size;
              s8 unk_0C[0x4];
} GameAllocEntry;
typedef struct GameAlloc {
               GameAllocEntry base;
               GameAllocEntry* head;
} GameAlloc;
void func_800D3720_jp(GameAlloc* this);
void* gamealloc_malloc(GameAlloc* this, size_t size);
void gamealloc_free(GameAlloc* this, void* ptr);
void gamealloc_cleanup(GameAlloc* this);
void gamealloc_init(GameAlloc* this);
typedef struct Input {
               OSContPad cur;
               OSContPad prev;
               OSContPad press;
               OSContPad rel;
} Input;
void pad_init(Input* input);
void pad_cleanup(void);
void pad_flush(Input* input);
s32 pad_push_only(Input* input, u16 value);
s32 pad_push_also(Input* input, u16 key);
s32 pad_on_trigger(Input* input, u16 key);
s32 pad_off_trigger(Input* input, u16 key);
u16 pad_button(Input* input);
u16 pad_trigger(Input* input);
s8 pad_physical_stick_x(Input* input);
s8 pad_physical_stick_y(Input* input);
void pad_set_logical_stick(Input* input, s32 x, s32 y);
s8 pad_logical_stick_x(Input* input);
s8 pad_logical_stick_y(Input* input);
s8 pad_stick_x(Input* input);
s8 pad_stick_y(Input* input);
void pad_correct_stick(Input* input);
typedef struct Controller {
               f32 moveX;
               f32 moveY;
               f32 moveR;
               s16 moveAngle;
               f32 lastMoveX;
               f32 lastMoveY;
               f32 lastMoveR;
               s16 lastMoveAngle;
               f32 adjustedX;
               f32 adjustedY;
               f32 adjustedR;
               f32 lastAdjustedX;
               f32 lastAdjustedY;
               f32 lastAdjustedR;
} Controller;
struct Game;
void mCon_ct(struct Game* game);
void mCon_dt(struct Game* game);
void mCon_calc(Controller* controller, f32 x, f32 y);
void mCon_main(struct Game* game);
s32 chkButton(u16 mask);
u16 getButton(void);
s32 chkTrigger(u16 mask);
u16 getTrigger(void);
s32 getJoystick_X(void);
s32 getJoystick_Y(void);
struct Game;
struct GraphicsContext;
struct struct_80145020_jp;
typedef enum GameStateId {
           GAMESTATE_FIRST_GAME,
           GAMESTATE_MAP_SELECT,
           GAMESTATE_PLAY,
           GAMESTATE_SECOND_GAME,
           GAMESTATE_00743CD0,
           GAMESTATE_TRADEMARK,
           GAMESTATE_PLAYER_SELECT,
           GAMESTATE_SAVE_MENU,
           GAMESTATE_FAMICOM_EMU,
           GAMESTATE_PRENMI,
               GAMESTATE_ID_MAX
} GameStateId;
typedef void (*GameStateFunc)(struct Game* game);
typedef struct {
               void* loadedRamAddr;
               RomOffset vromStart;
               RomOffset vromEnd;
               void* vramStart;
               void* vramEnd;
               void* unk_14;
               GameStateFunc init;
               GameStateFunc destroy;
               void* unk_20;
               void* unk_24;
               s32 unk_28;
               size_t instanceSize;
} GameStateOverlay;
typedef struct Game {
               struct GraphicsContext* gfxCtx;
               GameStateFunc main;
               GameStateFunc destroy;
               GameStateFunc init;
               size_t size;
               Input input[4];
               s32 unk_74;
               TwoHeadArena heap;
               GameAlloc alloc;
               u8 unk_9C;
               u8 unk_9D;
               u8 disableDisplay;
               u8 running;
               s32 unk_A0;
               s32 disablePrenmi;
               Controller controller;
} Game;

typedef struct CollisionBGCheck_WallInfo {
  s16 angleY;
  s16 type;
} CollisionBGCheck_WallInfo;

typedef struct CollisionBGCheck_result{
    u32 onGround:1;
    u32 unk:5;
    u32 hitWall:5;
    u32 hitWallCount:3;
    u32 unk2:18;
}CollisionBGCheck_result;

typedef struct CollisionBGCheck{
    u8 unk0[0x11];
    CollisionBGCheck_result result;
    u8 unk14[0xC];
    CollisionBGCheck_WallInfo wallInfo[2];
    s16 pad;
}CollisionBGCheck;
void func_800D2E00_jp(Game* game);
void func_800D2E58_jp(u16 button, Gfx** gfxP);
void game_debug_draw_last(Game* game, struct GraphicsContext* gfxCtx);
void game_draw_first(struct GraphicsContext* gfxCtx);
void game_draw_last(struct GraphicsContext* gfxCtx);
void game_get_controller(Game* game);
void SetGameFrame(s32 divisor);
void game_main(Game* game);
void game_init_hyral(Game* game, size_t size);
void game_resize_hyral(Game* game, size_t size);
void game_ct(Game* game, GameStateFunc init, struct GraphicsContext* gfxCtx);
void game_dt(Game* game);
GameStateFunc game_get_next_game_init(Game* game);
size_t game_get_next_game_class_size(Game* game);
s32 game_is_doing(Game* game);
s32 game_getFreeBytes(Game* game);
void game_goto_next_game_play(Game* game);
void game_goto_next_game_name_famicom_emu(Game* game);
extern Game* gamePT;
extern struct struct_80145020_jp B_80145020_jp;
extern s16 B_80145040_jp;
extern Game* game_class_p;
extern u8 game_GameFrame;
extern f32 game_GameFrameF;
extern f32 game_GameFrame_2F;
extern f32 game_GameFrame__1F;
extern GameStateOverlay game_dlftbls[GAMESTATE_ID_MAX];
extern GameStateId game_dlftbls_num;
struct Actor;
struct Game_Play;
struct ActorEntry;
struct ActorOverlay;
struct struct_801161E8_jp;
struct LightsN;
struct GraphicsContext;
typedef enum AllocType {
            ALLOCTYPE_NORMAL,
            ALLOCTYPE_ABSOLUTE,
            ALLOCTYPE_PERMANENT
} AllocType;
typedef enum ActorPart {
            ACTOR_PART_0,
            ACTOR_PART_1,
            ACTOR_PART_PLAYER,
            ACTOR_PART_NPC,
            ACTOR_PART_4,
            ACTOR_PART_5,
            ACTOR_PART_6,
            ACTOR_PART_7,
            ACTOR_PART_MAX
} ActorPart;
typedef enum ActorFootIndex {
            FOOT_LEFT,
            FOOT_RIGHT,
            FOOT_MAX
} ActorFootIndex;
typedef enum FgNameF000 {
              FGNAME_F000_0 = 0x0,
              FGNAME_F000_5 = 0x5,
              FGNAME_F000_8 = 0x8,
              FGNAME_F000_D = 0xD,
              FGNAME_F000_E
} FgNameF000;
typedef void (*ActorFunc)(struct Actor* this, struct Game_Play* game_play);
typedef struct ActorProfile {
               s16 name;
               u8 part;
               u32 flags;
               u16 unk_08;
               s16 objectId;
               size_t instanceSize;
               ActorFunc ct;
               ActorFunc dt;
               ActorFunc update;
               ActorFunc draw;
               ActorFunc save;
} ActorProfile;
typedef struct PosRot {
               xyz_t pos;
               s_xyz rot;
} PosRot;
typedef void (*Shape_Info_unk_0C)(struct Actor*, struct LightsN*, struct Game_Play*);
typedef struct Shape_Info {
               s_xyz rot;
               f32 unk_08;
               Shape_Info_unk_0C unk_0C;
               f32 unk_10;
               f32 unk_14;
               f32 unk_18;
               f32 unk_1C;
               s32 unk_20;
               xyz_t* unk_24;
               s32 unk_28;
               s8 unk_2C;
               s8 unk_2D;
               s8 unk_2E;
               s8 unk_2F[0x1];
               xyz_t feetPos[FOOT_MAX];
} Shape_Info;
typedef struct Actor {
                s16 name;
                u8 part;
                u8 unk_003;
                u16 unk_004;
                u16 fgName;
                s8 unk_008;
                s8 unk_009;
                s16 unk_00A;
                PosRot home;
                u32 flags;
                s16 params;
                s16 unk_026;
                PosRot world;
                xyz_t prevPos;
                PosRot eye;
                xyz_t scale;
                xyz_t velocity;
                f32 speed;
                f32 gravity;
                f32 terminalVelocity;
                s32 unk_080;
                CollisionBGCheck bgCheck;
                s8 unk_0B4[0x1];
                u8 isDrawn;
                s16 yawTowardsPlayer;
                f32 xyzDistToPlayerSq;
                f32 xzDistToPlayer;
                f32 playerHeightRel;
                CollisionCheck_Status colStatus;
                Shape_Info shape;
                xyz_t projectedPos;
                f32 projectedW;
                f32 uncullZoneScale;
                f32 uncullZoneDownward;
                f32 unk_13C;
                f32 unk_140;
                f32 unk_144;
                u8 unk_148;
                u8 unk_149;
                s8 unk_14A[0x2];
                struct Actor* parent;
                struct Actor* child;
                struct Actor* prev;
                struct Actor* next;
                ActorFunc ct;
                ActorFunc dt;
                ActorFunc update;
                ActorFunc draw;
                ActorFunc save;
                struct ActorOverlay* overlayEntry;
} Actor;
typedef struct Part_Break {
               MtxF* matrices;
               s16* objectIds;
               s16 count;
               Gfx** dLists;
               s32 val;
               s32 prevLimbIndex;
} Part_Break;
typedef struct ActorListEntry {
              s32 unk_0;
              Actor* head;
} ActorListEntry;
typedef struct ActorInfo {
               s32 unk_00;
               ActorListEntry actorLists[ACTOR_PART_MAX];
} ActorInfo;
void projection_pos_set(struct Game_Play* game_play, xyz_t* worldPos, xyz_t* projectedPos, f32* invW);
void Actor_world_to_eye(Actor* actor, f32 arg1);
void Actor_position_move(Actor* actor);
void Actor_position_speed_set(Actor* actor);
void Actor_position_moveF(Actor* actor);
s32 Actor_player_look_direction_check(Actor* actor, s16 maxAngleDiff, struct Game_Play* game_play);
void Actor_display_position_set(struct Game_Play* game_play, Actor* actor, s16* x, s16* y);
void Shape_Info_init(Actor* actor, f32 arg1, Shape_Info_unk_0C arg2, f32 arg3, f32 arg4);
void Actor_foot_shadow_pos_set(Actor* actor, s32 limbIndex, s32 leftFootIndex, xyz_t* leftFootPos, s32 rightFootIndex, xyz_t* rightFootPos);
void Actor_delete(Actor* actor);
s32 Actor_draw_actor_no_culling_check(Actor* actor);
s32 Actor_draw_actor_no_culling_check2(Actor* actor, xyz_t* arg1, f32 arg2);
void Actor_cull_check(Actor* actor);
void Actor_delete_check(Actor* actor, struct Game_Play* game_play);
void Actor_info_ct(struct Game_Play* game_play2, ActorInfo* actorInfo, struct ActorEntry* actorEntry);
void Actor_info_dt(ActorInfo* actorInfo, struct Game_Play* game_play);
void Actor_info_call_actor(struct Game_Play* game_play, ActorInfo* actorInfo);
void Actor_info_draw_actor(struct Game_Play* game_play, ActorInfo* actorInfo);
void Actor_free_overlay_area(struct ActorOverlay* overlayEntry);
void Actor_get_overlay_area(struct ActorOverlay* overlayEntry, const struct struct_801161E8_jp* arg1, size_t overlaySize);
void Actor_init_actor_class(Actor* actor, ActorProfile* profile, struct ActorOverlay* overlayEntry, struct Game_Play* game_play, s32 arg4, f32 x, f32 y, f32 z, s16 rotX, s16 rotY, s16 rotZ, s8 argB, s8 argC, s16 argD, u16 fgName, s16 params);
Actor* Actor_info_make_actor(ActorInfo* actorInfo, struct Game_Play* game_play, s16 actorId, f32 x, f32 y, f32 z, s16 rotX, s16 rotY, s16 rotZ, s8 arg9, s8 argA, s16 argB, u16 fgName, s16 params, s8 argE, s32 argF);
Actor* Actor_info_make_child_actor(ActorInfo* actorInfo, Actor* arg1, struct Game_Play* game_play, s16 actorId, f32 x, f32 y, f32 z, s16 rotX, s16 rotY, s16 rotZ, s16 argA, u16 fgName, s16 params, s32 argD);
void restore_fgdata(Actor* actor, struct Game_Play* game_play);
void restore_fgdata_one(Actor* actor, struct Game_Play* game_play);
void restore_fgdata_all(struct Game_Play* game_play);
void Actor_info_save_actor(struct Game_Play* game_play);
Actor* Actor_info_delete(ActorInfo* actorInfo, Actor* actor, struct Game_Play* game_play);
Actor* Actor_info_name_search(ActorInfo* actorInfo, s16 name, ActorPart part);
Actor* Actor_info_fgName_search(ActorInfo* actorInfo, u16 fgName, ActorPart part);
void Part_Break_init(Part_Break* partBreak, s32 count, s32 arg2);
Gfx* HiliteReflect_new(xyz_t* object, xyz_t* eye, xyz_t* lightDir, struct GraphicsContext* gfxCtx, Gfx* gfx, Hilite** hilite);
Hilite* HiliteReflect_init(xyz_t* object, xyz_t* eye, xyz_t* lightDir, struct GraphicsContext* gfxCtx);
Hilite* HiliteReflect_xlu_init(xyz_t* object, xyz_t* eye, xyz_t* lightDir, struct GraphicsContext* gfxCtx);
Hilite* HiliteReflect_light_init(xyz_t* object, xyz_t* eye, xyz_t* lightDir, struct GraphicsContext* gfxCtx);
Hilite* Setpos_HiliteReflect_init(xyz_t* object, struct Game_Play* game_play);
Hilite* Setpos_HiliteReflect_xlu_init(xyz_t* object, struct Game_Play* game_play);
Hilite* Setpos_HiliteReflect_light_init(xyz_t* object, struct Game_Play* game_play);
struct Actor;
struct Global_light;
typedef void (*Kankyo_unk_C0)(struct Actor*);
typedef struct Kankyo {
               s8 unk_00[0x2];
               s8 unk_02;
               s8 unk_03;
               s8 unk_04;
               s8 unk_05[0x3];
               s8 unk_08[0xA6];
               u8 unk_AE;
               u8 unk_AF;
               u8 unk_B0;
               s8 unk_B1[0xF];
               Kankyo_unk_C0 unk_C0;
               s8 unk_C4[0x4];
} Kankyo;
void Global_kankyo_ct(struct Game_Play* game_play, struct Kankyo* kankyo);
void Global_kankyo_set(struct Game_Play* game_play, struct Kankyo* kankyo, struct Global_light* arg2);
void mEnv_WindMove(void);
void mEnv_DecideWeather_NormalGameStart(void);
typedef struct ListAlloc {
              struct ListAlloc* prev;
              struct ListAlloc* next;
} ListAlloc;
typedef struct PreRender {
               u16 unk_00;
               u16 unk_02;
               u16 unk_04;
               u16 unk_06;
               s8 unk_08[0x8];
               void* unk_10;
               void* unk_14;
               void* unk_18;
               s8 unk_1C[0x34];
} PreRender;
void PreRender_setup_savebuf(PreRender* render, s32 arg1, s32 arg2, s32 arg3, s32 arg4, s32 arg5);
void PreRender_init(PreRender* render);
void PreRender_setup_renderbuf(PreRender* render, s32 arg1, s32 arg2, void* arg3, void* arg4);
void PreRender_cleanup(PreRender* render);
void PreRender_CopyRGBC(PreRender* render, Gfx** gfxP, s32 arg2, s32 arg3);
void PreRender_saveFrameBuffer(PreRender* render, Gfx** gfx);
void PreRender_saveCVG(PreRender* render, Gfx** gfx);
void PreRender_loadFrameBufferCopy(PreRender* render, Gfx** gfx);
void PreRender_ConvertFrameBuffer_fg(PreRender* render);
typedef enum bool {
    false,
    true
} bool;
typedef struct Struct_8010EAA0 {
               RomOffset unk_00;
               RomOffset unk_04;
               char unk08[0xB];
               u8 unk_13;
} Struct_8010EAA0;
typedef struct struct_801161E8_jp {
              s8 unk_0[0x8];
} struct_801161E8_jp;
typedef struct CommonData_unk_1004C_unk_14_arg0 {
               s16 unk_00;
               s16 unk_02;
               s8 unk_04[0x60];
} CommonData_unk_1004C_unk_14_arg0;
typedef struct Game_Play_unk_0110_unk_0000 {
               s16 unk_00;
               s8 unk_02[0x2];
               void* segment;
               s8 unk_08[0x48];
               s16 unk_50;
               s8 unk_52[0x2];
} Game_Play_unk_0110_unk_0000;
typedef struct Game_Play_unk_0110 {
                 Game_Play_unk_0110_unk_0000 unk_0000[1];
                 s8 unk_0054[0x17A8];
                 s32 unk_17FC;
                 s8 unk_1800[0x18];
                 void* unk_1818;
} Game_Play_unk_0110;
typedef struct ShadowData {
               u32 numberOfVertices;
               u8* vertexFixFlagTable;
               f32 size;
               Vtx* vertices;
               Gfx* model;
} ShadowData;
typedef struct struct_809AEFA4 {
               void* unk_00;
               void* unk_04;
               s32 unk_08;
               void* unk_0C;
               void* unk_10;
               void* unk_14;
} struct_809AEFA4;
typedef struct struct_func_8085CE18_jp_arg4 {
               s8 unk_00[0x24];
               u16 unk_24;
               u8 unk_26;
} struct_func_8085CE18_jp_arg4;
struct GraphicsContext;
struct Game;
typedef enum {
            MTXMODE_NEW,
            MTXMODE_APPLY
} MatrixMode;
void new_Matrix(struct Game* game);
void Matrix_push(void);
void Matrix_pull(void);
void Matrix_get(MtxF* dest);
void Matrix_put(MtxF* src);
MtxF* get_Matrix_now(void);
void Matrix_mult(MtxF* mf, u8 mode);
void Matrix_translate(f32 x, f32 y, f32 z, u8 mode);
void Matrix_scale(f32 x, f32 y, f32 z, u8 mode);
void Matrix_RotateX(s16 x, MatrixMode mode);
void Matrix_RotateY(s16 y, MatrixMode mode);
void Matrix_RotateZ(s16 z, MatrixMode mode);
void Matrix_rotateXYZ(s16 x, s16 y, s16 z, MatrixMode mode);
void Matrix_softcv3_mult(xyz_t* translation, s_xyz* rot);
void Matrix_softcv3_load(f32 x, f32 y, f32 z, s_xyz* rot);
Mtx* _MtxF_to_Mtx(MtxF* src, Mtx* dest);
Mtx* _Matrix_to_Mtx(Mtx* dest);
Mtx* _Matrix_to_Mtx_new(struct GraphicsContext* gfxCtx);
void _MtxF_to_Mtx_new(MtxF* src, struct GraphicsContext* gfxCtx);
void Matrix_Position(xyz_t* src, xyz_t* dest);
void Matrix_Position_Zero(xyz_t* dest);
void Matrix_Position_VecX(f32 x, xyz_t* dest);
void Matrix_Position_VecY(f32 y, xyz_t* dest);
void Matrix_Position_VecZ(f32 z, xyz_t* dest);
void Matrix_copy_MtxF(MtxF* dest, MtxF* src);
void Matrix_MtxtoMtxF(Mtx* src, MtxF* dest);
void Matrix_MtxF_Position2(xyz_t* src, xyz_t* dest, MtxF* mf);
void Matrix_reverse(MtxF* mf);
void Matrix_rotate_scale_exchange(MtxF* mf);
void Matrix_to_rotate_new(MtxF* src, s_xyz* dest, s32 nonUniformScale);
void Matrix_to_rotate2_new(MtxF* src, s_xyz* dest, s32 nonUniformScale);
void Matrix_RotateVector(s16 angle, xyz_t* axis, u8 mode);
void suMtxMakeTS(Mtx* mtx, f32 scaleX, f32 scaleY, f32 scaleZ, f32 translateX, f32 translateY, f32 translateZ);
void suMtxMakeSRT(Mtx* mtx, f32 scaleX, f32 scaleY, f32 scaleZ, s16 rotX, s16 rotY, s16 rotZ, f32 translateX,
                  f32 translateY, f32 translateZ);
void suMtxMakeSRT_ZXY(Mtx* mtx, f32 scaleX, f32 scaleY, f32 scaleZ, s16 rotX, s16 rotY, s16 rotZ, f32 translateX,
                      f32 translateY, f32 translateZ);
extern Mtx Mtx_clear;
typedef u8 lbRTC_sec_t;
typedef u8 lbRTC_min_t;
typedef u8 lbRTC_hour_t;
typedef u8 lbRTC_day_t;
typedef u8 lbRTC_weekday_t;
typedef u8 lbRTC_month_t;
typedef u16 lbRTC_year_t;
typedef struct lbRTC_time_c {
             lbRTC_sec_t sec;
             lbRTC_min_t min;
             lbRTC_hour_t hour;
             lbRTC_day_t day;
             lbRTC_weekday_t weekday;
             lbRTC_month_t month;
             lbRTC_year_t year;
} lbRTC_time_c;
typedef struct lbRTC_ymd_t {
               lbRTC_year_t year;
               lbRTC_month_t month;
               lbRTC_day_t day;
} lbRTC_ymd_t;
typedef enum WEEKDAYS {
            lbRTC_WEEKDAYS_BEGIN = 0,
            lbRTC_SUNDAY = lbRTC_WEEKDAYS_BEGIN,
            lbRTC_MONDAY,
            lbRTC_TUESDAY,
            lbRTC_WEDNESDAY,
            lbRTC_THURSDAY,
            lbRTC_FRIDAY,
            lbRTC_SATURDAY,
            lbRTC_WEEK,
            lbRTC_WEEKDAYS_MAX = lbRTC_WEEK
} WEEKDAYS;
typedef enum MONTHS {
            lbRTC_MONTHS_BEGIN = 0,
            lbRTC_JANUARY = 1,
            lbRTC_FEBRUARY,
            lbRTC_MARCH,
            lbRTC_APRIL,
            lbRTC_MAY,
            lbRTC_JUNE,
            lbRTC_JULY,
            lbRTC_AUGUST,
            lbRTC_SEPTEMBER,
             lbRTC_OCTOBER,
             lbRTC_NOVEMBER,
             lbRTC_DECEMBER,
             lbRTC_MONTHS_MAX = lbRTC_DECEMBER
} MONTHS;
typedef enum RTC_EQUALITY {
    lbRTC_LESS = -1,
    lbRTC_EQUAL = 0,
    lbRTC_OVER = 1
} RTC_EQUALITY;
typedef enum RTC_EQUALITY_FLAGS {
              lbRTC_CHECK_NONE = 0,
              lbRTC_CHECK_SECONDS = 1 << 0,
              lbRTC_CHECK_MINUTES = 1 << 1,
              lbRTC_CHECK_HOURS = 1 << 2,
              lbRTC_CHECK_WEEKDAYS = 1 << 3,
              lbRTC_CHECK_DAYS = 1 << 4,
              lbRTC_CHECK_MONTHS = 1 << 5,
              lbRTC_CHECK_YEARS = 1 << 6,
    lbRTC_CHECK_ALL = lbRTC_CHECK_SECONDS |
                      lbRTC_CHECK_MINUTES |
                      lbRTC_CHECK_HOURS |
                      lbRTC_CHECK_WEEKDAYS |
                      lbRTC_CHECK_DAYS |
                      lbRTC_CHECK_MONTHS |
                      lbRTC_CHECK_YEARS
} RTC_EQUALITY_FLAGS;
struct Game;
typedef struct mFM_fg_c {
              u16 items[16][16];
} mFM_fg_c;
void func_80087004_jp(void);
void func_80087280_jp(void);
void mFM_SetBlockKindLoadCombi(struct Game* game);
void mFM_InitFgCombiSaveData(struct Game* game);
void mFM_RenewalReserve(void);
typedef enum mHm_ROOM{
            mHm_ROOM_MAIN,
            mHm_ROOM_UPPER,
            mHm_ROOM_BASEMENT,
            mHm_ROOM_NUM
} mHm_ROOM;
typedef enum mHm_ROOMTYPE {
            mHm_ROOMTYPE_SMALL,
            mHm_ROOMTYPE_MEDIUM,
            mHm_ROOMTYPE_LARGE,
            mHm_ROOMTYPE_COTTAGE,
            mHm_ROOMTYPE_NUM
} mHm_ROOMTYPE;
typedef enum mHm_HOMESIZE {
            mHm_HOMESIZE_SMALL,
            mHm_HOMESIZE_MEDIUM,
            mHm_HOMESIZE_LARGE,
            mHm_HOMESIZE_UPPER,
            mHm_HOMESIZE_STATUE,
            mHm_HOMESIZE_NUM
}mHm_HOMESIZE;
typedef struct Haniwa_Item_c {
               u16 item;
               s16 exchange_type;
               u16 extra_data;
} Haniwa_Item_c;
typedef struct Haniwa_c {
               Haniwa_Item_c items[4];
               u8 message[64];
               u32 bells;
} Haniwa_c;
typedef struct mHm_hs_c {
                PersonalID unk_000;
                s8 unk_010[0x12];
                u8 unk_022;
                s8 unk023[0x1];
                u8 unk_024;
                s8 unk025[0xABB];
                Haniwa_c haniwa;
                s8 unkB3C[0xC];
} mHm_hs_c;
typedef struct mLd_land_info_c {
    char unk00[0xA];
} mLd_land_info_c;
typedef struct NpcList {
               char unk00[0x10];
               xyz_t position;
               char unk14[0x1C];
} NpcList;
typedef struct AnmHome_c {
               u8 typeUnused;
               u8 blockX;
               u8 blockZ;
               u8 utX;
               u8 utZ;
} AnmHome_c;
typedef struct AnmPersonalId_c {
               u16 npcId;
               u16 landId;
               u8 landName[6];
               u8 nameId;
               u8 looks;
} AnmPersonalID_c;
typedef struct Animal_c {
                AnmPersonalID_c id;
                char unk00C[0x4D4];
                AnmHome_c homeInfo;
                char unk4E5[0x43];
} Animal_c;
typedef enum NpcLooks{
            NPC_LOOKS_GIRL,
            NPC_LOOKS_KO_GIRL,
            NPC_LOOKS_BOY,
            NPC_LOOKS_SPORT_MAN,
            NPC_LOOKS_GRIM_MAN,
            NPC_LOOKS_NANIWA_LADY,
            NPC_LOOKS_NUM
}NpcLooks;
void mNpc_ClearAnimalPersonalID(AnmPersonalID_c*);
s32 mNpc_CheckFreeAnimalPersonalID(AnmPersonalID_c*);
void mNpc_CopyAnimalPersonalID(AnmPersonalID_c*, AnmPersonalID_c*);
s32 mNpc_CheckCmpAnimalPersonalID(AnmPersonalID_c*, AnmPersonalID_c*);
void mNpc_RenewalAnimalMemory(void);
s32 mNpc_CheckFreeAnimalInfo(Animal_c*);
void func_800A91DC_jp(void);
void func_800AA124_jp(void);
s32 mNpc_GetLooks(u16 arg0);
void func_800AB054_jp(void);
void func_800AB09C_jp(void);
void mNpc_SetNpcList(NpcList* npclist, Animal_c* animals, s32 count, s32 malloc_flag);
void mNpc_SetNpcinfo(struct Actor* actor, s8 arg1);
s32 mNpc_GetInAnimalP(void);
void mNpc_SetRemoveAnimalNo(Animal_c* animal);
void mNpc_SendRegisteredGoodbyMail(void);
void mNpc_SetReturnAnimal(s32 arg0);
void mNpc_GetNpcWorldNameAnm(PlayerName* arg0, struct mMl_get_npcinfo_from_mail_name_arg0* arg1);
void mNpc_InitNpcAllInfo(s32 arg0);
void func_800AD9FC_jp(void);
void mNpc_ClearTalkInfo(void);
typedef struct NpcWalk {
               char unk00[0x7C];
} NpcWalk;
typedef struct NpcWalkGoalData {
              u8* types;
              u8 count;
              s32 time;
} NpcWalkGoalData;
typedef struct NpcWalkGoalDataTable {
              NpcWalkGoalData* data;
              int count;
} NpcWalkGoalDataTable;
typedef struct NpcWalkAppear {
              u8 status;
              u8 way;
} NpcWalkAppear;
typedef struct NpcWalkInfo {
               AnmPersonalID_c id;
               s32 idx;
               u8 status;
               u8 type;
               u8 goalX;
               u8 goalZ;
               NpcWalkAppear appearInfo;
} NpcWalkInfo;
typedef struct NpcWalking {
               NpcWalkInfo info[(int)((15) / 3)];
               u16 idxUse;
               u8 infoUse;
               u8 infoMax;
} NpcWalking;
typedef enum WalkGoal{
            NPCW_GOAL_SHRINE,
            NPCW_GOAL_HOME,
            NPCW_GOAL_ALONE,
            NPCW_GOAL_MY_HOME,
            NPCW_GOAL_NUM
}WalkGoal;
typedef enum WalkGoalBlock{
            NPCW_GOAL_BLOCK_SHRINE,
            NPCW_GOAL_BLOCK_HOME,
            NPCW_GOAL_BLOCK_NUM
}WalkGoalBlock;
typedef enum WalkAppearStatus {
            NPCW_APPEAR_STATUS_0,
            NPCW_APPEAR_STATUS_1,
            NPCW_APPEAR_STATUS_NUM
}WalkAppearStatus;
typedef enum WalkAppearDirection {
            NPCW_APPEAR_WAY_UP,
            NPCW_APPEAR_WAY_DOWN,
            NPCW_APPEAR_WAY_LEFT,
            NPCW_APPEAR_WAY_RIGHT,
            NPCW_APPEAR_WAY_NUM
}WalkAppearDirection;
typedef enum WalkInfoStatus {
            NPCW_INFO_STATUS_0,
            NPCW_INFO_STATUS_WALKING,
            NPCW_INFO_STATUS_2,
            NPCW_INFO_STATUS_3,
            NPCW_INFO_STATUS_4,
            NPCW_INFO_STATUS_NUM
}WalkInfoStatus;
NpcWalkGoalData* mNpcW_GetGoalDataInfo(s32 looks, s32 time);
void mNpcW_ClearNpcWalkAppear(NpcWalkAppear* info);
void mNpcW_ClearNpcWalkInfo(NpcWalkInfo* info , s32 count);
void mNpcW_ClearNpcWalk(NpcWalking* walk);
s32 mNpcW_CheckFreeNpcWalkInfo(NpcWalkInfo* info );
s32 mNpcW_GetFreeNpcWalkInfoIdx(NpcWalkInfo* info , s32 num );
s32 mNpcW_GetNpcWalkInfoIdx(NpcWalkInfo* info , s32 num , AnmPersonalID_c* anmId );
s32 mNpcW_GetNpcWalkInfoIdxbyIdx(NpcWalkInfo* info , s32 num , s32 idx );
s32 mNpcW_DecideNpc(Animal_c* animal , u16 used );
void mNpcW_SetNpcWalkInfo(NpcWalkInfo* info , Animal_c* animal , s32 idx );
s32 mNpcW_ChangeNpcWalk(NpcWalking* walk , NpcWalkInfo* info );
s32 mNpcW_GetAloneBlock(u8* goalBlockX , u8* goalBlockZ );
void mNpcW_GetBlockXZNumExceptHome(s32* goalBlockX , s32* goalBlockZ , Animal_c* animal );
s32 mNpcW_CheckDiffBlockWalkNpcHome(s32 blockX , s32 blockZ , NpcWalkInfo* info );
void mNpcW_SetHomeBlockSource(NpcWalking* walk , Animal_c* animal );
void mNpcW_InitGoalBlockSource(NpcWalking* walk , Animal_c* animal );
void mNpcW_SetGoalBlock(NpcWalkInfo* info );
void mNpcW_InitNpcWalk(NpcWalking* walk );
s32 mNpcW_GetAppearStatusWay(u8* status , u8* way , Animal_c* animal );
s32* mNpcW_GetArriveStayCountP(s32 idx );
s32 mNpcW_GetWalkInfoStatusGoalAnimalIdx(s32* status , s32* goal , s32 idx );
s32 mNpcW_GetNearGate(s32* targetUtX , s32* targetUtZ , s32 blockX , s32 blockZ , s32 utX , s32 utZ );
typedef enum NpsScheduleType{
            NPS_SCHEDULE_FIELD,
            NPS_SCHEDULE_IN_HOUSE,
            NPS_SCHEDULE_SLEEP,
            NPS_SCHEDULE_STAND,
            NPS_SCHEDULE_WANDER,
            NPS_SCHEDULE_SPECIAL,
            NPS_SCHEDULE_TYPE_NUM
} NpsScheduleType;
typedef struct NpsScheduleData {
               NpsScheduleType type;
               s32 endTime;
} NpsScheduleData;
typedef struct NpsScheduleDataTable {
               s32 count;
               NpsScheduleData* scheduleData;
} NpsScheduleDataTable;
typedef struct NpsSchedule{
               AnmPersonalID_c* id;
               NpsScheduleDataTable* dataTable;
               u8 currentType;
               u8 forcedType;
               u8 savedType;
               s32 forcedTimer;
}NpsSchedule;
NpsSchedule* mNPS_get_schedule_area(AnmPersonalID_c* id);
void mNPS_set_schedule_area(AnmPersonalID_c* id);
void mNPS_reset_schedule_area(AnmPersonalID_c* id);
void mNPS_schedule_manager_sub0(void);
void mNPS_schedule_manager_sub(void);
void mNPS_schedule_manager(void);
void mNPS_set_all_schedule_area(void);
typedef struct mQst_not_saved_c {
             s32 work;
             u8 h;
} mQst_not_saved_c;
typedef struct mQst_delivery_c {
             char unk00[0x24];
} mQst_delivery_c;
typedef struct mQst_errand_c {
             char unk00[0x50];
} mQst_errand_c;
typedef enum mPr_SEX {
            mPr_SEX_MALE,
            mPr_SEX_FEMALE,
            mPr_SEX_NUM
} mPr_SEX;
typedef enum mPr_ITEM_COND{
            mPr_ITEM_COND_NORMAL,
            mPr_ITEM_COND_PRESENT,
            mPr_ITEM_COND_QUEST,
            mPr_ITEM_COND_NUM
} mPr_ITEM_COND;
typedef struct Private_Sub_A86 {
               char unk00[0x3];
               u8 unk_03;
               char unk04[0x1];
               u8 unk_05;
               u16 unk_06;
               u8 unk_08;
} Private_Sub_A86;
typedef struct mPr_map_info_c {
             char unk00[0x8];
} mPr_map_info_c;
typedef struct PrivateInventory {
               u16 pockets[15];
               u8 lotto_ticket_expiry_month;
               u8 lotto_ticket_mail_storage;
               u32 item_conditions;
               u32 wallet;
               u32 loan;
} PrivateInventory;
typedef struct Private_c {
                s8 unk000[0x10];
                s8 gender;
                s8 unk011[0x3];
                PrivateInventory inventory;
                mQst_delivery_c deliveries[15];
                mQst_errand_c errands[5];
                s8 unk_3EC[0x2];
                MailHeaderCommon unk_3EE;
                Mail unk_40A[10];
                s8 unk_A72[0x2];
                u8 exists;
                s8 unkA75[0x11];
                Private_Sub_A86 unk_A86;
                s8 unkA8F[0xF8];
                mPr_map_info_c maps[8];
                s8 unkBC8[0x8];
} Private_c;
typedef struct SnowmanData {
               u8 exists;
               u8 headSize;
               u8 bodySize;
               u8 unk3;
} SnowmanData;
typedef struct SnowmanInfo {
               s32 unk0;
               xyz_t position;
} SnowmanInfo;
s32 mSN_check_life(u16* name, s32 daysElapsed);
void mSN_ClearSnowmanData(u16* name, s32 snowmanIndex);
s32 mSN_ClearSnowman(u16* name);
s32 mSN_MeltSnowman(u16* name, s32 daysElapsed);
s32 mSN_get_free_space(void);
void mSN_regist_snowman_society(SnowmanInfo* snowmanInfo);
void mSN_decide_msg(void);
void mSN_snowman_init(void);
struct Actor;
struct ActorOverlay;
struct struct_801161E8_jp;
struct Game_Play_unk_0110_unk_0000;
struct CommonData_unk_1004C_unk_14_arg0;
struct Game_Play;
struct struct_809AEFA4;
typedef s32 (*CommonData_unk_1004C_unk_04)(struct ActorOverlay*, const struct struct_801161E8_jp*, size_t, s32);
typedef s32 (*CommonData_unk_1004C_unk_08)(void);
typedef void* (*CommonData_unk_1004C_unk_0C)(size_t, const struct struct_801161E8_jp*, s32);
typedef s32 (*CommonData_unk_1004C_unk_10)(struct Actor*);
typedef s32 (*CommonData_unk_1004C_unk_14)(struct CommonData_unk_1004C_unk_14_arg0*, u16);
typedef s32 (*CommonData_unk_1004C_unk_BC)(struct Actor*, struct Game_Play*);
typedef void (*CommonData_unk_1004C_unk_C0)(struct Actor*, struct Game_Play*, struct struct_809AEFA4*);
typedef s32 (*CommonData_unk_1004C_unk_C4)(struct Actor*, struct Game_Play*);
typedef s32 (*CommonData_unk_1004C_unk_C8)(struct Actor*, struct Game_Play*);
typedef s32 (*CommonData_unk_1004C_unk_CC)(struct Actor*, struct Game_Play*);
typedef s32 (*CommonData_unk_1004C_unk_D0)(void);
typedef s32 (*CommonData_unk_1004C_unk_E4)(void);
typedef s32 (*CommonData_unk_1004C_unk_EC)(struct Game_Play_unk_0110_unk_0000*, s16, s16);
typedef s32 (*CommonData_unk_1004C_unk_F0)(struct Game_Play_unk_0110_unk_0000*, struct Actor*);
typedef s32 (*CommonData_unk_1004C_unk_F4)(struct Game_Play_unk_0110_unk_0000*, struct Actor*);
typedef s32 (*CommonData_unk_1004C_unk_118)(struct Actor*);

typedef int (*CommonData_unk_1004C_unk_00)(struct Game_Play*, u16, s8, s32, s16, s32, s32, s32, s32);
typedef struct CommonData_unk_1004C {
                CommonData_unk_1004C_unk_00 unk_00;
                CommonData_unk_1004C_unk_04 unk_04;
                CommonData_unk_1004C_unk_08 unk_08;
                CommonData_unk_1004C_unk_0C unk_0C;
                CommonData_unk_1004C_unk_10 unk_10;
                CommonData_unk_1004C_unk_14 unk_14;
                s8 unk_18[0xA4];
                CommonData_unk_1004C_unk_BC unk_BC;
                CommonData_unk_1004C_unk_C0 unk_C0;
                CommonData_unk_1004C_unk_C4 unk_C4;
                CommonData_unk_1004C_unk_C8 unk_C8;
                CommonData_unk_1004C_unk_CC unk_CC;
                CommonData_unk_1004C_unk_D0 unk_D0;
                s8 unk_D4[0x10];
                CommonData_unk_1004C_unk_E4 unk_E4;
                s8 unk_E8[0x4];
                CommonData_unk_1004C_unk_EC unk_EC;
                CommonData_unk_1004C_unk_F0 unk_F0;
                CommonData_unk_1004C_unk_F4 unk_F4;
                s8 unk_F8[0x20];
                CommonData_unk_1004C_unk_118 unk_118;
} CommonData_unk_1004C;
typedef s32 (*CommonData_unk_10078_unk_00)(s32);
typedef s32 (*CommonData_unk_10078_unk_04)(s32);
typedef s32 (*CommonData_unk_10078_unk_08)(s32);
typedef struct CommonData_unk_10078 {
               CommonData_unk_10078_unk_00 unk_00;
               CommonData_unk_10078_unk_04 unk_04;
               CommonData_unk_10078_unk_08 unk_08;
} CommonData_unk_10078;
typedef s32 (*CommonData_unk_10098_unk_4)(struct ActorOverlay*, size_t);
typedef s32 (*CommonData_unk_10098_unk_8)(void);
typedef void* (*CommonData_unk_10098_unk_0C)(void);
typedef s32 (*CommonData_unk_10098_unk_10)(struct Actor*);
typedef s32 (*CommonData_unk_10098_unk_A8)(void*, s32, u16 name, Actor* actor);
typedef s32 (*CommonData_unk_10098_unk_AC)(u16);
typedef s32 (*CommonData_unk_10098_unk_450)(u16);
typedef struct CommonData_unk_10098 {
               s8 unk_00[0x4];
               CommonData_unk_10098_unk_4 unk_4;
               CommonData_unk_10098_unk_8 unk_08;
               CommonData_unk_10098_unk_0C unk_0C;
               CommonData_unk_10098_unk_10 unk_10;
                s8 unk_14[0x94];
                CommonData_unk_10098_unk_A8 unk_A8;
                CommonData_unk_10098_unk_AC unk_AC;
                s32 unk_B0;
                s8 pad[0x450-0xb4];
                CommonData_unk_10098_unk_450 unk_450;
                s32 unk_454;
                s8 pad2[0x86C-0x458];
                s32 unk_86C;
} CommonData_unk_10098;
typedef struct mPr_mother_mail_info_c {
               s8 unk_00[0xE];
} mPr_mother_mail_info_c;
typedef enum Season {
            SPRING,
            SUMMER,
            FALL,
            WINTER,
} Season;
typedef struct Time_c {
               u32 season;
               u32 termIdx;
               s16 bgitemProfile;
               s16 bgitemBank;
               s32 nowSec;
               lbRTC_time_c rtcTime;
               s16 radMin;
               s16 radHour;
               u8 timeSignal;
               u8 underSec;
               u8 disp;
               u8 rtcCrashed;
               s32 rtcEnabled;
               s32 addSec;
               s32 addIdx;
} Time_c;
typedef struct FamicomEmuCommonData {
               s16 unk00;
               s16 unk02;
               s16 unk04;
               s16 unk06;
               s16 unk08;
               s16 unk0A;
               s16 unk0C;
               s16 unk0E;
               s16 unk10;
               s16 unk12;
               s16 unk14;
               s16 unk16;
               s16 unk18;
               s16 unk1A;
               s16 unk1C;
               s16 unk1E;
               s16 unk20;
               s16 unk22;
               s16 unk24;
}FamicomEmuCommonData;
typedef void (*CommonData_100E4_Func)(struct Game_Play*);

typedef void (*unk00)(s32, xyz_t, s32, short, struct Game*, u16, s16, s16);
typedef void (*unk30)(f32*,s16,s16,s16);
typedef void* (*unkAC)(s32);
typedef void (*unkA8)(void*,s32,s32,Actor*);
typedef void* (*unk450)(s32);
typedef struct CommonData_unk_1009C{
    unk00 unk00Proc;
    s8 pad[0x2C];
    unk30 unk30Proc;
}CommonData_unk_1009C;

typedef struct WeatherPrv{
    xyz_t pos;
    xyz_t speed;
    f32 currentY;
    f32 unk1C;
    s16 timer;
    s16 work[5]; 
    u8 use;
    u8 id;
    u8 status;
}WeatherPrv;

typedef struct Weather Weather;

typedef void (*unk4)(Actor*, s16, s16);
typedef void (*ChangeWeatherProc)(Actor* weather, s16 status, s16 level);
typedef int (*GetWeatherPrvvNumProc)(Actor* weather);
typedef void (*RemoveWeatherPrvProc)(Actor* weather, int id);
typedef WeatherPrv* (*GetWeatherPrvProc)(u8 status, s16 timer, xyz_t* pos, xyz_t* speed, Actor* weather, int id);
typedef int (*WeatherSoundEffectProc)();
typedef void (*ChangeWeatherInstanceProc)(Weather* weather, s16 status, s16 level);

typedef struct WeatherClip{
    Weather* actor;
    unk4 unk4proc;
    ChangeWeatherProc changeWeather;
    GetWeatherPrvvNumProc getPrvNum;
    RemoveWeatherPrvProc removePrv;
    GetWeatherPrvProc getPrv;
    WeatherSoundEffectProc stopSound;
    WeatherSoundEffectProc startSound;
    ChangeWeatherInstanceProc changeWeatherInstance;
}WeatherClip; 


typedef void (*MakeWeatherProc)(Actor*,Game*);
typedef void (*CtWeatherProc)(WeatherPrv*, Game*);
typedef void (*MvWeatherProc)(WeatherPrv*, Game*);
typedef void (*StWeatherProc)(Game*);
typedef void (*DwWeatherProc)(WeatherPrv*, Game*);

typedef struct WeatherProfile{
    MakeWeatherProc mk;
    CtWeatherProc ct;
    MvWeatherProc mv;
    StWeatherProc st;
    DwWeatherProc dw;
}WeatherProfile;

typedef struct WeatherOvlInfo {
    /* 0x00 */ RomOffset vromStart;
    /* 0x04 */ RomOffset vromEnd;
    /* 0x08 */ void* vramStart;
    /* 0x0C */ void* vramEnd;
    /* 0x10 */ void* ovlTypeEnd;
} WeatherOvlInfo; // size = 0x14

typedef struct WeatherDmaInfo{
    /* 0x00 */ RomOffset vromStart;
    /* 0x04 */ RomOffset vromEnd;
}WeatherDmaInfo;

WeatherOvlInfo weatherOvlTable[4];

WeatherDmaInfo* weatherDmaTable[5];
void ovlmgr_Load(RomOffset vromStart, RomOffset vromEnd, void* vramStart, void* vramEnd, void* allocatedRamAddr);
s32 DmaMgr_RequestSyncDebug(void* vram, RomOffset vrom, size_t size, const char* filename, s32 line);
#define FI_GET_TYPE(field_id) ((field_id) & 0xF000)
struct Weather{
    /* 0x000 */ Actor actor;
    /* 0x174 */ WeatherProfile* currentProfile; 
    /* 0x178 */ s16 currentStatus;
    /* 0x17A */ s16 nextStatus;
    /* 0x17C */ s16 counter;
    /* 0x17E */ s16 currentLevel;
    /* 0x180 */ s16 currentAimLevel;
    /* 0x182 */ s16 nextLevel;
    /* 0x184 */ u8* segment;
    /* 0x188 */ xyz_t pos;
    /* 0x194 */ WeatherPrv* priv;
    /* 0x198 */ void* allocatedSize; 
    /* 0x19C */ u8 requestChange;
    /* 0x19E */ s16 unk19E;
    /* 0x1A0 */ WeatherClip clip; 
    /* 0x1C4 */ s16 timer;
    /* 0x1C6 */ s16 timer2;
    /* 0x1C8 */ xyz_t windInfo;
    /* 0x1D4 */ s16 lightningTimer;
    /* 0x1D6 */ s16 lightningTimer2;
    /* 0x1D8 */ s16 currentSoundEffect;
    /* 0x1DA */ s16 umbrellaFlag;
    /* 0x1DC */ s16 currentYAngle;
    /* 0x1DE */ s16 soundFlag;
    /* 0x1E0 */ s16 startSoundEffect;
    /* 0x1E2 */ s16 stopSoundEffect;
    /* 0x1E4 */ s16 basementEvent;
}; 
void sAdo_SysTrgStart(u16);
#define RANDOM_F(n) (fqrand() * (f32)(n))
typedef struct CommonData {
                  u8 unk00000[0x14];
                  s32 sceneNo;
                  u8 nowNpcMax;
                  u8 removeAnimalIdx;
                  u8 unk1A[0x20 - 0x1A];
                  Private_c private[4];
                  mLd_land_info_c land_info;
                  u8 unk02F6A[0x61E];
                  mHm_hs_c homes[4];
                  mFM_fg_c fg[(10 - 4)][(7 - 2)];
                  u8 unk09EA8[0x70];
                  Animal_c animals[15];
                  u8 unk0EC70[0x134];
                  mEv_event_save_c event_save_data;
                  u8 unk0EE40[0x118];
                  u16 fruit;
                  s8 unk_0EF5A[0x12];
                  Mail unk_0EF6C[5];
                  s8 unk_0F2A0[0x17C];
                  SnowmanData snowmanData[3];
                  s8 unk_F428[0x10];
                  u8 station_type;
                  u8 saveWeather;
                  u8 unk0F439[0x2];
                  u16 deposit[(7 - 2) * (10 - 4)][16];
                  lbRTC_time_c unk_0F7FC;
                  mPr_mother_mail_info_c mother_mail[4];
                  u8 unk0F83C[0x8];
                  FamicomEmuCommonData famicom_emu_common_data;
                  u8 unk0F86A[0x32];
                  lbRTC_time_c unk_0F89C;
                  lbRTC_time_c unk_0F8A4;
                  s8 unk0F8AC;
                  u8 snowmanYear;
                  u8 snowmanMonth;
                  u8 snowmanDay;
                  u8 snowmanHour;
                  s8 unk0F8B1[0x74F];
                  u8 unk_10000;
                  u8 unk_10001;
                  u8 unk10002[0x1];
                  u8 player_no;
                  s32 unk_10004;
                  s8 unk_10008[0x44];
                  CommonData_unk_1004C *unk_1004C;
                  s8 unk_10050[0x28];
                  CommonData_unk_10078 *unk_10078;
                  s8 unk_1007C[8];
                  WeatherClip* weatherClip;
                  s8 unk_10088[0x10];
                  CommonData_unk_10098 *unk_10098;
                  CommonData_unk_1009C* unk1009C; 
                  u8 unk100A0[0x44];
                  CommonData_100E4_Func* unk_100E4;
                  u8 unk100E8[0x24];
                  Time_c time;
                  Private_c* now_private;
                  u8 unk1013C[0x4];
                  u8 unk_10140;
                  u8 fish_location;
                  u8 unk10142[0x7];
                  u8 unk_10149;
                  u8 unk_1014A;
                  u8 unk_1014B;
                  s8 unk_1014C[0x2];
                  s16 unk_1014E;
                  s8 unk_10150[0x10];
                  NpcList npclist[15];
                  u16 house_owner_name;
                  u16 last_field_id;
                  s8 unk_104AC[0x1];
                  u8 unk_104AD;
                  s8 unk_104AE[0x2];
                  s8 unk_104B0[0xBC];
                  /* 0x01056C */ s16 weather;
                  /* 0x01056E */ s16 weatherIntensity;
                  /* 0x010570 */ lbRTC_time_c weatherTime;
                  /* 0x010578 */ s_xyz wind;
                  /* 0x010580 */ f32 windSpeed;
                  s8 unk10584[0x14];
                  mQst_not_saved_c quest;
                  u32 scene_from_title_demo;
                  NpsSchedule npcSchedule[15];
                  NpcWalking npcWalk;
                  s8 unk_10710[0x3C];
                  s32 unk_1074C;
                  s8 unk_10750[0x66];
                  s16 unk_107B6;
                  u8 unk107B8[0x28];
                  s8 player_decoy_flag;
                  u8 unk107E1[0x3];
                  s16 unk_107E4;
                  u8 unk107E6[0x254];
                  u8 goki_shocked_flag;
                  s8 unk_10A3B[0x1];
                  s8 unk_10A3C[0x3];
                  u8 trainExists;
                  s8 unk_10A40[0x4];
                  u8 currentTrainAction;
                  s8 unk_10A48[0x4];
                  f32 currentTrainSpeed;
                  xyz_t currentTrainPosition;
                  s8 unk_10A5C[0x12];
                  u8 unk_10A68;
                  s8 unk_10A69[0x3];
                  s8 unk_10A6C[0x14];
                  s8 unk_10A80[0x2];
                  s16 unk_10A82;
                  u8 unk10A84[0x2C];
                  u8 unk_10AB0;   
                  s8 unk_10AB1;
                  s16 currentSoundEffect;
                  s8 unk_10AB3[0x7];
} CommonData;
void common_data_reinit(void);
void common_data_init(void);
void common_data_clear(void);

extern CommonData common_data;
struct Game_Play;
struct GraphicsContext;

#define UNK_TYPE s32
#define UNK_TYPE1 s8
#define UNK_TYPE2 s16
typedef struct Game_Play1938 {
    /* 0x000 */ UNK_TYPE1 unk_000[0x8];
    /* 0x008 */ s32 unk_008;
    /* 0x00C */ s32 unk_00C;
    /* 0x010 */ s32 unk_010;
    /* 0x018 */ s32 unk_014;
    /* 0x01C */ UNK_TYPE1 unk_018[0x10];
    /* 0x028 */ xyz_t unk_028;
    /* 0x034 */ UNK_TYPE1 unk_034[0x1C];
    /* 0x050 */ Vp vp;
    /* 0x060 */ Mtx unk_060;
    /* 0x0A0 */ Mtx unk_0A0;
    /* 0x0E0 */ UNK_TYPE1 unk_0E0[0x40];
    /* 0x120 */ s32 unk_120;
    /* 0x124 */ UNK_TYPE1 unk_124[0x4];
} Game_Play1938; // size = 0x128
typedef struct ScissorViewArg1 {
               s32 unk_00;
               s32 unk_04;
               s32 unk_08;
               s32 unk_0C;
} ScissorViewArg1;
void initView(Game_Play1938* arg0, struct GraphicsContext* gfxCtx);
void setScissorView(Game_Play1938* arg0, ScissorViewArg1* arg1);
void showView(Game_Play1938* arg0, s32 arg1, struct Game_Play* game_play);
void showView1(Game_Play1938* arg0, s32 arg1, Gfx** gfx);
typedef struct {
              u8 r;
              u8 g;
              u8 b;
} Color_RGB8;
typedef struct {
              u8 r;
              u8 g;
              u8 b;
              u8 a;
} Color_RGBA8;
typedef struct {
              s16 r;
              s16 g;
              s16 b;
} Color_RGB16;
typedef union {
    struct {
        u8 r, g, b, a;
    };
    u32 rgba;
} Color_RGBA8_u32;
typedef struct {
    f32 r, g, b, a;
} Color_RGBAf;
typedef struct {
    u32 r, g, b, a;
} Color_RGBAu32;
typedef union {
    struct {
        u16 r : 5;
        u16 g : 5;
        u16 b : 5;
        u16 a : 1;
    };
    u16 rgba;
} Color_RGBA16;
typedef union {
    struct {
        u32 r : 5;
        u32 g : 5;
        u32 b : 5;
        u32 a : 1;
    };
    u16 rgba;
} Color_RGBA16_2;
typedef union{
    struct {
        u32 r : 3;
        u32 g : 3;
        u32 b : 3;
        u32 a : 5;
    };
    u16 rgba;
} Color_RGBA14;
struct GraphicsContext;
struct Game_Play;
typedef struct LightPoint {
              s16 x;
              s16 y;
              s16 z;
              u8 color[3];
              u8 drawGlow;
              s16 radius;
} LightPoint;
typedef struct LightDiffuse {
              s8 x;
              s8 y;
              s8 z;
              u8 color[3];
} LightDiffuse;
typedef union {
    LightPoint point;
    LightDiffuse diffuse;
} LightParams;
typedef struct Lights {
               u8 type;
               LightParams lights;
} Lights;
typedef struct LightNode {
              Lights* info;
              struct LightNode* prev;
              struct LightNode* next;
} LightNode;
typedef struct LightBuffer {
               s32 current;
               s32 idx;
               LightNode lights[32];
} LightBuffer;
typedef struct LightsN {
               u8 diffuse_count;
               Lightsn lights;
}LightsN;
typedef struct Global_light {
              LightNode* list;
              u8 ambientColor[3];
              u8 fogColor[3];
              s16 fogNear;
              s16 fogFar;
} Global_light;
typedef void (*light_point_proc)(LightsN*, LightParams*, xyz_t*);
typedef void (*light_P_point_proc)(LightsN*, LightParams*, xyz_t*);
void point_data_set(Lights* lights, s16 x, s16 y, s16 z, u8 r, u8 g, u8 b, s16 radius, s32 type);
void Light_point_ct(Lights* lights, s16 x, s16 y, s16 z, u8 r, u8 g, u8 b, s16 radius);
void Light_point2_ct(Lights* lights, s16 x, s16 y, s16 z, u8 r, u8 g, u8 b, s16 radius);
void Light_point_color_set(Lights* lights, u8 r, u8 g, u8 b, s16 radius);
void Light_diffuse_ct(Lights* lights, s8 x, s8 y, s8 z, u8 r, u8 g, u8 b);
void LightsN_ct(LightsN* lights, u8 r, u8 g, u8 b);
void LightsN_disp(LightsN* lights, struct GraphicsContext* gfxCtx);
Light* LightsN_new_diffuse(LightsN* lights);
void LightsN__point_proc(LightsN* lights, LightParams* lightInfo, xyz_t* point);
void LightsN__P_point_proc(LightsN* lights, LightParams* lightInfo, xyz_t* pos);
void LightsN__diffuse_proc(LightsN* lights, LightParams* lightInfo, xyz_t* pos);
void LightsN_list_check(LightsN* lights, LightNode* node, xyz_t* pos);
LightNode* Light_list_buf_new(void);
void Light_list_buf_delete(LightNode* lightNode);
void Global_light_ct(Global_light* glight);
void Global_light_ambient_set(Global_light* glight, u8 r, u8 g, u8 b);
void Global_light_fog_set(Global_light* glight, u8 r, u8 g, u8 b, s16 near, s16 far);
LightsN* Global_light_read(Global_light* glight, struct GraphicsContext* gfxCtx);
void Global_light_list_ct(Global_light* glight);
void Global_light_list_dt(Global_light* glight);
LightNode* Global_light_list_new(struct Game_Play* play, Global_light* glight, Lights* light);
void Global_light_list_delete(Global_light* glight, LightNode* lightNode);
LightsN* new_Lights(struct GraphicsContext* gfxCtx, u8 ambient_r, u8 ambient_g, u8 ambient_b, u8 count, u8 light_r,
                          u8 light_g, u8 light_b, s8 dir_x, s8 dir_y, s8 dir_z);
LightsN* new_LightsN(struct GraphicsContext* gfxCtx, u8 r, u8 g, u8 b);
void Light_list_point_draw(struct Game_Play* game_play);
typedef struct mCoBG_OffsetTable {
               u8 unitAttribute;
               s8 crOffset;
               s8 luOffset;
               s8 ldOffset;
               s8 rdOffset;
               s8 ruOffset;
               s8 slateSwitch;
} mCoBG_OffsetTable;
void func_8006BB64_jp(void);
void mCoBG_CalcTimerDecalCircle(void);
void func_8006C8D0_jp(void);
f32 mCoBG_GetBgY_OnlyCenter_FromWpos2(xyz_t arg0, f32 arg1);
s32 mCoBG_SearchWaterLimitDistN(s32* arg0, xyz_t arg1, s16 arg4, f32 arg5, s32 arg6);
void mCoBG_SetPluss5PointOffset_file(xyz_t pos, mCoBG_OffsetTable offsetData, char* file, s32 line);
typedef struct Pause {
              s32 enabled;
              s32 timer;
} Pause;
void Pause_ct(Pause* pause);
s32 Pause_proc(Pause* pause, Input* input);
struct Game_Play;
typedef struct Game_Play2128 {
               char unk00[0x10];
} Game_Play2128;
void fbdemo_fade_init(void* arg0);
void fbdemo_fade_move(void* arg0, u8 arg1);
void fbdemo_fade_draw(void* arg0, Gfx** gfx);
void fbdemo_fade_startup(void* arg0);
void fbdemo_fade_settype(void* arg0, s32 arg1);
void fbdemo_fade_setcolor_rgba8888(void* arg0, s32 arg1);
s32 fbdemo_fade_is_finish(void* arg0, struct Game_Play* game_play);
struct Game_Play;
struct Game_Play_unk_0110_unk_0000;
struct Game_Play;

typedef struct ActorEntry {
    /* 0x0 */ s16 id;
    /* 0x2 */ s_xyz pos;
    /* 0x8 */ s_xyz rot;
    /* 0xE */ s16 params;
} ActorEntry; // size = 0x10

typedef struct ObjectStatus {
    /* 0x00 */ s16 id;
    /* 0x04 */ void* segment;
    /* 0x08 */ s8 unk_08;
    /* 0x0C */ uintptr_t vrom;
    /* 0x10 */ size_t size;
    /* 0x14 */ s8 unk14;
    /* 0x18 */ char pad18[0x1C];
    /* 0x34 */ OSMesgQueue unk34;
    /* 0x4C */ s8 unk4C;
    /* 0x50 */ s16 unk50;
    /* 0x52 */ u8 unk52;
    /* 0x53 */ u8 unk53;
} ObjectStatus; // size = 0x54

#define OBJECT_EXCHANGE_BANK_MAX 73 // Name taken from oot debug string

typedef struct ObjectExchangeBank {
    /* 0x0000 */ ObjectStatus status[OBJECT_EXCHANGE_BANK_MAX]; // Name taken from oot debug string
    /* 0x17F4 */ s32 num; // Name taken from oot debug string
    /* 0x17F8 */ UNK_TYPE unk17F8;
    /* 0x17FC */ UNK_TYPE unk17FC;
    /* 0x1800 */ UNK_TYPE unk1800;
    /* 0x1804 */ UNK_TYPE unk1804;
    /* 0x1808 */ UNK_TYPE unk1808;
    /* 0x180C */ UNK_TYPE unk180C;
    /* 0x1810 */ UNK_TYPE unk1810;
    /* 0x1814 */ UNK_TYPE unk1814;
    /* 0x1818 */ UNK_PTR unk1818;
    /* 0x181C */ UNK_TYPE unk181C;
    /* 0x1820 */ UNK_TYPE unk1820;
} ObjectExchangeBank; // size = 0x1824

typedef struct {
    /* 0x0000 */ u8 unk0;
    /* 0x0001 */ u8 unk1;
    /* 0x0004 */ UNK_PTR unk4;
} MSceneUnkStruct;

s32 func_800C59B0_jp(ObjectExchangeBank* objectExchangeBank);
s32 func_800C5A08_jp(ObjectExchangeBank* objectExchangeBank);
s32 func_800C5A60_jp(ObjectExchangeBank* objectExchangeBank);
s32 func_800C5AA0_jp(ObjectStatus* objectStatus, ObjectExchangeBank* objectExchangeBank, s16 objectBankIndex);
void func_800C5B30_jp(ObjectStatus* objectStatus);
void mSc_clear_bank_status(ObjectStatus* objectStatus);
s32 func_800C5B74_jp(ObjectExchangeBank* objectExchangeBank, s16 id);
void Object_Exchange_keep_new_Player(s32 arg0);
u32 mSc_secure_exchange_keep_bank(ObjectExchangeBank* objectExchangeBank, s16 id, s32 size);
void func_800C5D68_jp(ObjectExchangeBank*);
void func_800C5E10_jp(ObjectExchangeBank* objectExchangeBank);
// void func_800C5EA0_jp();
s32 func_800C5F0C_jp(ObjectStatus* objectStatus, ObjectExchangeBank* objectExchangeBank);
void mSc_dmacopy_data_bank(ObjectExchangeBank* objectExchangeBank);
s32 mSc_bank_regist_check(ObjectExchangeBank* objectExchangeBank, s16 id);
s32 func_800C6144_jp(ObjectExchangeBank* objectExchangeBank, s16 arg1);
void mSc_regist_initial_exchange_bank(struct Game_Play* game_play);
void func_800C62C4_jp(ObjectStatus*, ObjectExchangeBank*, s32);
void mSc_dmacopy_all_exchange_bank(ObjectExchangeBank* objectExchangeBank);
void mSc_data_bank_ct(struct Game_Play* game_play, ObjectExchangeBank* objectExchangeBank);
void mSc_decide_exchange_bank(ObjectExchangeBank* objectExchangeBank);
// void func_800C6690_jp();
void Scene_ct(struct Game_Play* game_play, void* arg1);
// void func_800C6960_jp();
void Scene_Proc_Ctrl_Actor_Ptr(struct Game_Play* game_play, MSceneUnkStruct* arg1);
void Scene_Proc_Actor_Ptr(struct Game_Play* game_play, MSceneUnkStruct* arg1);
void Scene_Proc_Object_Exchange_Bank_Ptr(struct Game_Play* game_play, MSceneUnkStruct* arg1);
void Scene_Proc_Door_Data_Ptr(struct Game_Play* game_play, MSceneUnkStruct* arg1);
void Door_info_ct(s8* arg0);
void Scene_Proc_Sound(s8 arg0, s8 arg1);
// void func_800C6AE0_jp();
// void func_800C6B50_jp();
// void func_800C6BB0_jp();
// void func_800C6BD4_jp();
// void func_800C6BF8_jp();
// void func_800C6C10_jp();
// void func_800C6D14_jp();
// void func_800C6D5C_jp();
// void func_800C6E14_jp();

struct Actor;
struct ActorEntry;
struct Game_Play;

typedef void (*Game_Play_unk_1C58)(struct Actor*);
typedef UNK_RET (*Game_Play_unk_2208)(struct Actor*, struct Game_Play*);

typedef void (*Game_PlayUnkFunc_00)(void*);
typedef void (*Game_PlayUnkFunc_04)(void*, struct Game_Play*);
typedef void (*Game_PlayUnkFunc_08)(void*, u8);
typedef void (*Game_PlayUnkFunc_0C)(void*, Gfx**);
typedef void (*Game_PlayUnkFunc_10)(void*);
typedef void (*Game_PlayUnkFunc_14)(void*, s32);
typedef void (*Game_PlayUnkFunc_18)(void*, s32);
typedef void (*Game_PlayUnkFunc_1C)(void);
typedef s32 (*Game_PlayUnkFunc_20)(void*, struct Game_Play*);

typedef struct Game_PlayUnkFuncsStruct {
    /* 0x00 */ Game_PlayUnkFunc_00 unk_00;
    /* 0x04 */ Game_PlayUnkFunc_04 unk_04;
    /* 0x08 */ Game_PlayUnkFunc_08 unk_08;
    /* 0x0C */ Game_PlayUnkFunc_0C unk_0C;
    /* 0x10 */ Game_PlayUnkFunc_10 unk_10;
    /* 0x14 */ Game_PlayUnkFunc_14 unk_14;
    /* 0x18 */ Game_PlayUnkFunc_18 unk_18;
    /* 0x1C */ Game_PlayUnkFunc_1C unk_1C;
    /* 0x20 */ Game_PlayUnkFunc_20 unk_20;
} Game_PlayUnkFuncsStruct; // size = 0x24

typedef struct Game_Play_Unk_1EE8 {
    /* 0x000 */ char unk000[0x218];
    /* 0x218 */ s32 unk_218;
    /* 0x21C */ Game_PlayUnkFuncsStruct unk_21C;
} Game_Play_Unk_1EE8; // size = 0x240

typedef struct Camera2{
    xyz_t unk0;
    xyz_t unk4;
    u8 pad[0x120];
}Camera2;

typedef struct Game_Play {
    /* 0x0000 */ Game state;
    /* 0x00E0 */ s16 unk_00E0;
    /* 0x00E2 */ s8 unk_00E2[0x2];
    /* 0x00E4 */ s8 unk_00E4;
    /* 0x00E5 */ s8 unk_00E5;
    /* 0x00E6 */ s8 unk_00E6[0x2];
    /* 0x00E8 */ s8 unk_00E8[0x24];
    /* 0x010C */ void* unk_010C;
    /* 0x0110 */ ObjectExchangeBank objectExchangeBank;
    /* 0x1938 */ Game_Play1938 unk_1938;
    /* 0x1A60 */ Camera2 camera;
    /* 0x1B98 */ Kankyo kankyo;
    /* 0x1C60 */ Global_light glight;
    /* 0x1C70 */ Pause pause;
    /* 0x1C78 */ ActorInfo actorInfo;
    /* 0x1CBC */ Submenu submenu;
    /* 0x1DAC */ s8 unk_1DAC;
    /* 0x1DAD */ s8 unk_1DAD[0x3];
    /* 0x1DB0 */ s8 unk_1DB0[0x10];
    /* 0x1DC0 */ PreRender unk_1DC0;
    /* 0x1E10 */ s32 unk_1E10;
    /* 0x1E14 */ UNK_PTR unk_1E14;
    /* 0x1E18 */ s32 unk_1E18;
    /* 0x1E1C */ MtxF viewProjectionMtxF;
    /* 0x1E5C */ MtxF billboardMtxF;
    /* 0x1E9C */ Mtx* unk_1E9C;
    /* 0x1EA0 */ s32 unk_1EA0;
    /* 0x1EA4 */ s8 unk_1EA4[0x1];
    /* 0x1EA5 */ u8 unk_1EA5;
    /* 0x1EA6 */ u8 unk_1EA6;
    /* 0x1EA7 */ u8 unk_1EA7;
    /* 0x1EA8 */ struct ActorEntry* unk_1EA8;
    /* 0x1EAC */ struct ActorEntry* unk_1EAC;
    /* 0x1EB0 */ s16* unk_1EB0;
    /* 0x1EB4 */ s16* unk_1EB4;
    /* 0x1EB8 */ s32 unk_1EB8;
    /* 0x1EBC */ Event event;
    /* 0x1ECC */ s8 unk_1ECC[0x14];
    /* 0x1EE0 */ u8 unk_1EE0;
    /* 0x1EE1 */ u8 unk_1EE1;
    /* 0x1EE2 */ u8 unk_1EE2;
    /* 0x1EE3 */ u8 unk_1EE3;
    /* 0x1EE4 */ s8 unk_1EE4[0x4];
    /* 0x1EE8 */ Game_Play_Unk_1EE8 unk_1EE8;
    /* 0x2128 */ Game_Play2128 unk_2128;
    /* 0x2138 */ CollisionCheck unk_2138;
    /* 0x2208 */ Game_Play_unk_2208 unk_2208;
    /* 0x220C */ s32 unk_220C;
    /* 0x2210 */ Struct_8010EAA0* unk_2210;
    /* 0x2214 */ s8 unk_2214[0x1FC];
} Game_Play; // size = 0x2410

void play_init(Game* game);
void play_cleanup(Game* game);
Mtx* _Matrix_to_Mtx_new(struct GraphicsContext* gfxCtx);

extern uintptr_t gSegments[NUM_SEGMENTS];
#define RDRAM_CACHED 0x80000000



// TODO: After uintptr_t cast change should have an AVOID_UB target that just toggles the KSEG0 bit in the address rather than add/sub 0x80000000
#define PHYSICAL_TO_VIRTUAL(addr) ((uintptr_t)(addr) + RDRAM_CACHED)
#define VIRTUAL_TO_PHYSICAL(addr) (uintptr_t)((u8*)(addr) - RDRAM_CACHED)
#define SEGMENTED_TO_VIRTUAL(addr) (void*)(PHYSICAL_TO_VIRTUAL(gSegments[SEGMENT_NUMBER(addr)]) + SEGMENT_OFFSET(addr))


s16 atans_table(f32,f32); 
f32 mCoBG_CheckBallRollingArea(s16 angle, const xyz_t* wpos);
extern s32 mCoBG_CheckAttribute_BallRolling(s16* angles, const xyz_t* wpos);
f32 mCoBG_GetBgY_AngleS_FromWpos(s_xyz*, xyz_t, f32);
extern int mFI_Wpos2BkandUtNuminBlock(int* bx, int* bz, int* ut_x, int* ut_z, xyz_t wpos);
extern int mNpc_CheckNpcSet(int bx, int bz, int ut_x, int ut_z);
extern void mFI_BkandUtNum2CenterWpos(xyz_t* wpos, int bx, int bz, int ut_x, int ut_z);
#define FI_UT_WORLDSIZE_Z 40
#define FI_UT_WORLDSIZE_Z_F (f32)FI_UT_WORLDSIZE_Z
#define FI_UT_WORLDSIZE_X 40
#define FI_UT_WORLDSIZE_X_F (f32)FI_UT_WORLDSIZE_Z
#define FI_UT_BASE_SIZE 40
#define FI_UT_BASE_SIZE_F ((f32)FI_UT_BASE_SIZE)

u16* mFI_GetUnitFG(xyz_t);
typedef s32 (*SetMgrGetEndPosProc)(struct Game*, xyz_t*);

typedef struct Player {
    /* 0x0000 */ Actor actor;
    /* 0x0174 */ s8 unk_0174[0xB7C];
    /* 0x0CF0*/ s32 unk_0CF0;
    /* 0x0CF4*/ s32 unk_0CF4;
    /* 0x0CF8 */ s8 unk_0CF8[0x8];
    /* 0x0D00 */ s32 unk_0D00;
    /* 0x0D04 */ s32 unk_0D04;
    /* 0x0D08 */ s32 unk_0D08;
    /* 0x0D0C */ s8 unk_0D0C[0xA0];
    /* 0x0DAC */ s32 unk_0DAC;
    /* 0x0DB0 */ s32 unk_0DB0;
    /* 0x0DB4 */ s8 unk_0DB4[0x8];
    /* 0x0DBC */ s32 unk_0DBC[2];
    /* 0x0DC4 */ s8 unk_0DC4[0x18];
    /* 0x0DDC */ s32 unk_0DDC[2];
    /* 0x0DE4 */ s32 unk_0DE4[2];
    /* 0x0DEC */ s8 unk_0DEC[0x160];
    /* 0x0F4C */ ClObjTris colliderTris1;
    /* 0x0F60 */ s8 unk_0F60[0x44];
    /* 0x0FA4 */ ClObjTris colliderTris2;
    /* 0x0FB8 */ s8 unk_0FB8[0x50];
    /* 0x1008 */ ClObjPipe colliderPipe;
    /* 0x1024 */ s8 unk_1024[0x220];
    /* 0x1024 */ SetMgrGetEndPosProc getEndPos;
    /* 0x1048 */ s8 unk_1048[0x70];
    /* 0x12B8 */ s32 unk_12B8;
    /* 0x12BC */ s32 unk_12BC;
    /* 0x12C0 */ u16 unk_12C0;
    /* 0x12C2 */ s8 unk_12C2[0x2];
    /* 0x12C4 */ s8 unk_12C4[0x14];
} Player; // size = 0x12D8
extern f32 Math3d_normalizeXyz_t(xyz_t* vec);
 Player* get_player_actor_withoutCheck(struct Game_Play* game_play);
extern f32 search_position_distance(const xyz_t* const pos, const xyz_t* const target);
void add_calc0(f32* pValue, f32 fraction, f32 step);

#define ENV_SAVE_GET_WEATHER_TYPE(w) (((w) & 0xF0) >> 4) 
#define ENV_SAVE_GET_WEATHER_INTENSITY(w) ((w) & 0xF)

s32 mEnv_DecideWindDirect(s_xyz*, s16, s16);

xyz_t* Camera2_getCenterPos_p();

typedef enum {
    /* 0 */ DEBUG_REG_START = 0,
    /* 0 */ DEBUG_REG_REG = DEBUG_REG_START, 
    /* 1 */ DEBUG_REG_SREG,
    /* 2 */ DEBUG_REG_OREG,
    /* 3 */ DEBUG_REG_PREG,
    /* 4 */ DEBUG_REG_QREG,
    /* 5 */ DEBUG_REG_MREG,
    /* 6 */ DEBUG_REG_SBREG,
    /* 7 */ DEBUG_REG_DREG,
    /* 8 */ DEBUG_REG_UREG,
    /* 9 */ DEBUG_REG_IREG,
    /* 10 */ DEBUG_REG_ZREG,
    /* 11 */ DEBUG_REG_CRV,
    /* 12 */ DEBUG_REG_NS1,
    /* 13 */ DEBUG_REG_SND,
    /* 14 */ DEBUG_REG_XREG,
    /* 15 */ DEBUG_REG_CRV2,
    /* 16 */ DEBUG_REG_DEMOREG,
    /* 17 */ DEBUG_REG_TREG,
    /* 18 */ DEBUG_REG_WREG,
    /* 19 */ DEBUG_REG_AREG,
    /* 20 */ DEBUG_REG_VREG,
    /* 21 */ DEBUG_REG_HREG,
    /* 22 */ DEBUG_REG_GREG,
    /* 23 */ DEBUG_REG_mREG,
    /* 24 */ DEBUG_REG_nREG,
    /* 25 */ DEBUG_REG_BREG,
    /* 26 */ DEBUG_REG_DORO,
    /* 27 */ DEBUG_REG_kREG,
    /* 28 */ DEBUG_REG_BAK,
    /* 29 */ DEBUG_REG_PLAYERREG,
    /* 30 */ DEBUG_REG_NMREG,

    /* 31 */ DEBUG_REG_NIIREG,
    /* 32 */ DEBUG_REG_GENREG,
    /* 33 */ DEBUG_REG_MYKREG,
    /* 34 */ DEBUG_REG_CAMREG,
    /* 35 */ DEBUG_REG_SAKREG,
    /* 36 */ DEBUG_REG_TAKREG,
    /* 37 */ DEBUG_REG_PL2REG,

    /* 38 */ DEBUG_REG_MAX
} DEBUG_REG;

#define DEBUG_REG_SIZE 16
#define DEBUG_REG_GROUP 6

#define DEBUG_REG_COUNT (DEBUG_REG_SIZE * DEBUG_REG_GROUP * DEBUG_REG_MAX)

typedef struct Debug_mode {
    /* 0x00 */ u8 mode;
    /* 0x01 */ u8 type;
    /* 0x02 */ s8 inputR;
    /* 0x03 */ s8 keyWait;

    /* 0x04 */ s32 oldKey;
    /* 0x08 */ s32 pad[3];

    /* 0x14 */ s16 r[DEBUG_REG_SIZE * DEBUG_REG_GROUP * DEBUG_REG_MAX];
} Debug_mode; // size = 0x1C94

extern Debug_mode* debug_mode;


#define REGADDR(reg, idx) (debug_mode->r[DEBUG_REG_SIZE * DEBUG_REG_GROUP * DEBUG_REG_##reg + (idx)])

#define GETREG(reg, idx) (REGADDR(reg, idx))

#define REG(r) GETREG(REG,r)
#define SREG(r) GETREG(SREG,r)
#define OREG(r) GETREG(OREG,r)
#define PREG(r) GETREG(PREG,r)
#define QREG(r) GETREG(QREG,r)
#define MREG(r) GETREG(MREG,r)
#define SBREG(r) GETREG(SBREG,r)
#define DREG(r) GETREG(DREG,r)
#define UREG(r) GETREG(UREG,r)
#define IREG(r) GETREG(IREG,r)
#define ZREG(r) GETREG(ZREG,r)
#define CRV(r) GETREG(CRV,r)
#define NS1(r) GETREG(NS1,r)
#define SND(r) GETREG(SND,r)
#define XREG(r) GETREG(XREG,r)
#define CRV2(r) GETREG(CRV2,r)
#define DEMOREG(r) GETREG(DEMOREG,r)
#define TREG(r) GETREG(TREG,r)
#define WREG(r) GETREG(WREG,r)
#define AREG(r) GETREG(AREG,r)
#define VREG(r) GETREG(VREG,r)
#define HREG(r) GETREG(HREG,r)
#define GREG(r) GETREG(GREG,r)
#define mREG(r) GETREG(mREG,r)
#define nREG(r) GETREG(nREG,r)
#define BREG(r) GETREG(BREG,r)
#define DORO(r) GETREG(DORO,r)
#define kREG(r) GETREG(kREG,r)
#define BAK(r) GETREG(BAK,r)
#define PLAYERREG(r) GETREG(PLAYERREG,r)
#define NMREG(r) GETREG(NMREG,r)
#define NIIREG(r) GETREG(NIIREG,r)
#define GENREG(r) GETREG(GENREG,r)
#define MYKREG(r) GETREG(MYKREG,r)
#define CAMREG(r) GETREG(CAMREG,r)
#define SAKKREG(r) GETREG(SAKKREG,r)
#define TAKREG(r) GETREG(TAKREG,r)
#define PL2REG(r) GETREG(PL2REG,r)


typedef void (*FaultClientCallback)(void*, void*);

// TODO: taken from MM, needs to be verified
typedef struct FaultClient {
    /* 0x0 */ struct FaultClient* next;
    /* 0x4 */ FaultClientCallback callback;
    /* 0x8 */ void* arg0;
    /* 0xC */ void* arg1;
} FaultClient; // size = 0x10


typedef uintptr_t (*FaultAddrConvClientCallback)(uintptr_t, void*);

// TODO: taken from MM, needs to be verified
typedef struct FaultAddrConvClient {
    /* 0x0 */ struct FaultAddrConvClient* next;
    /* 0x4 */ FaultAddrConvClientCallback callback;
    /* 0x8 */ void* arg;
} FaultAddrConvClient; // size = 0xC

void fault_AddClient(FaultClient* client, FaultClientCallback callback, void* arg0, void* arg1);
void fault_RemoveClient(FaultClient* client);
void fault_AddressConverterAddClient(FaultAddrConvClient* client, FaultAddrConvClientCallback callback, void* arg);
void fault_AddressConverterRemoveClient(FaultAddrConvClient* client);
void fault_WaitForInput(void);
void fault_FillScreenBlack(void);
void fault_SetFrameBuffer(void* fb, u16 w, u16 h);
void fault_Init(void);
NORETURN void fault_AddHungupAndCrashImpl(const char* exp1, const char* exp2);
NORETURN void fault_AddHungupAndCrash(const char* file, s32 line);

#define WORK_DISP __gfxCtx->work.p
#define SHADOW_DISP __gfxCtx->shadow.p
#define FONT_DISP __gfxCtx->font.p

typedef struct Game_Prenmi {
    /* 0x00 */ Game state;
    /* 0xE0 */ UNK_TYPE1 unk00[0xE8 - 0xE0];
} Game_Prenmi; // size = 0xE8

void func_800D79F4_jp(void);
void* malloc(size_t size);
u32 GetCurrentMilliseconds(void);
void game_dt(Game* game);

void func_8005578C_jp(GameStateOverlay*); 

void func_800D8644_jp(void); 

s32 func_800D9700_jp(void);

void* func_800D9750_jp(void);

s64* ucode_GetRspBootTextStart(void);
size_t ucode_GetRspBootTextSize(void);
s64* ucode_GetPolyTextStart(void);
s64* ucode_GetPolyDataStart(void);
s64* ucode_GetSpriteTextStart(void);
s64* ucode_GetSpireDataStart(void);

struct Game_Play;

typedef enum AnimationMode {
    /* 0 */ ANIMATION_STOP,
    /* 1 */ ANIMATION_REPEAT
} AnimationMode;

typedef struct {
    /* 0x00 */ f32 start;
    /* 0x04 */ f32 end;
    /* 0x08 */ f32 duration;
    /* 0x0C */ f32 speed;
    /* 0x10 */ f32 currentFrame;
    /* 0x14 */ AnimationMode mode;
} FrameControl; // size = 0x18

typedef struct {
    /* 0x0 */ Gfx* shape;
    /* 0x4 */ u8 numberOfChildren;
    /* 0x5 */ u8 displayBufferFlag;
    /* 0x6 */ s_xyz translation;
} JointElemR; // size = 0xC

typedef struct {
    /* 0x00 */ u8 numberOfJoints;
    /* 0x01 */ u8 unk01;
    /* 0x04 */ JointElemR* jointElemTable;
} BaseSkeletonR; // size = 0x8

// original name unknown
typedef struct {
    /* 0x00 */ s16 frame;
    /* 0x02 */ s16 value;
    /* 0x04 */ s16 velocity;
} Keyframe; // size = 0x06

typedef struct {
    /* 0x00 */ u8* constKeyCheckBitTable;
    /* 0x04 */ Keyframe* dataSource;
    /* 0x08 */ s16* keyframeNumber;
    /* 0x0C */ s16* constValueTable;
    /* 0x10 */ s16 unk10;
    /* 0x12 */ s16 duration;
} BaseAnimationR; // size = 0x14

typedef struct {
    /* 0x00 */ s32 transformationFlag;
    /* 0x04 */ xyz_t baseWorldPosition;
    /* 0x10 */ s16 baseAngleY;
    /* 0x14 */ xyz_t baseShapeTranslation;
    /* 0x20 */ s_xyz baseShapeRotation;
    /* 0x26 */ s_xyz updatedBaseShapeRotation;
    /* 0x2C */ f32 counter;
    /* 0x30 */ xyz_t shapeWorldPositionCorrection;
    /* 0x3C */ s16 shapeAngleCorrection;
} AnimationMove; // size = 0x40

typedef struct {
    /* 0x00 */ FrameControl frameControl;
    /* 0x18 */ BaseSkeletonR* skeleton;
    /* 0x1C */ BaseAnimationR* animation;
    /* 0x20 */ f32 morphCounter;
    /* 0x24 */ s_xyz* jointTable;
    /* 0x28 */ s_xyz* morphTable;
    /* 0x2C */ s_xyz* diffRotTable;
    /* 0x30 */ AnimationMove animationMove;
} SkeletonInfoR; // size = 0x70

typedef struct {
    /* 0x00 */ SkeletonInfoR* skeletonInfo;
    /* 0x04 */ u8* constKeyCheckBitTable;
    /* 0x08 */ s16* constValueTable;
    /* 0x0C */ Keyframe* dataSource;
    /* 0x10 */ s16* keyframeNumber;
    /* 0x14 */ s32 keyframeNumberIndex;
    /* 0x18 */ s32 ckcbIndex;
    /* 0x1C */ s32 keyframeStartIndex;
} SkeletonInfoRCombineWork; // size = 0x20

typedef s32 (*DrawCallback)(struct Game_Play* game_play, SkeletonInfoR* skeletonInfo, s32 jointIndex, Gfx** dlist, u8* displayBufferFlag, void*, s_xyz* rotation, xyz_t* translation);

void cKF_FrameControl_zeroClear(FrameControl* frameControl);
void cKF_FrameControl_ct(FrameControl* frameControl);
void cKF_FrameControl_setFrame(FrameControl* frameControl, f32 start, f32 end, f32 duration, f32 currentFrame,
                               f32 speed, AnimationMode mode);
s32 cKF_FrameControl_passCheck(FrameControl* frameControl, f32 compareFrame, f32* remainder);
s32 cKF_FrameControl_passCheck_now(FrameControl* frameControl, f32 compareFrame);
s32 cKF_FrameControl_stop_proc(FrameControl* frameControl);
s32 cKF_FrameControl_repeat_proc(FrameControl* frameControl);
s32 cKF_FrameControl_play(FrameControl* frameControl);
f32 cKF_HermitCalc(f32 t, f32 duration, f32 p0, f32 p1, f32 v0, f32 v1);
